var reformatData = {
  "f8d4627a-7830-11e7-9e78-d9b1c842a413": {
    "title": "Linux System Administrator / System Engineer",
    "description": ". Do you want to work at scale? As part of our Backend Operations team, you will be responsible for services used by millions of players all around the world. You will work closely with our developers to run in house and open source solutions. We love to know every corner of our systems and most of them are on our own hardware in datacenters in Hamburg and overseas.. . . . . Your profile:. . . . . . . Some years professional experience administering *nix systems . . .  Comfortable with using various command line tools e.g. (d|net|vm|io)?stat. . .  Proficient in at least one scripting language. . . Open and friendly communication style. . . Good English skills. . . . . Our technologies:. . . . . . . KVM, LVM, Debian, Puppet. . . MySQL (Percona, Galera Cluster), PostgreSQL, Redis, Memcached, RabbitMQ. . . nginx, Tomcat, Jetty, Django. . . Python, Java, PHP, Go. . . Graphite / Grafana, Nagios, Sentry, ELK stack. . . git, Jenkins, Maven, Docker. . . Slack, Jira, Confluence, Bitbucket, Gitlab. . . . . Why join InnoGames?. . . . . . . Be part of a great team in an international environment in a healthy and stable growing company.. . . Choose your preferred device (Linux, Mac or even Windows) for your comfortable workplace. . . We will actively support your further development and give you all needed resources to evaluate new technologies, participate in open source communities or improve your soft skills.. . . Our career model is set up equally for an expert in a technical career or a management path.. . . Opportunities to make your code open source and show your achievements at international conferences.. . . Competitive compensation. . . Benefits like relocation support, company gym, smartphone or tablet, company bikes, rooftop terrace with BBQ and much more…. . . Check out some of our code: . github.com/innogames. . . . . . . Apply here. . "
  },
  "52a4e146-4e3f-11e8-8ef6-3fb76ee048bf": {
    "title": "Developer",
    "description": ". Who we are:. Join Roady's team - Be part of the transportation revolution! Transportation is changing quickly. Between fuel efficiency, electric vehicles, driver assist technology and many other exciting developments, the way goods and services move today won't be how they move in 10 years. Roady's is looking to add a few team members as we help our customers adapt and thrive through all the change.. . . . A little bit about you:. Have you ever operated a lemonade stand as a child? Tried to start a new business? Are you naturally business curious? Self Starter? Inquisitive? Enthusiastic? Motivated? Possess an entrepreneurial spirit? Are you always one step ahead whether in work, school, or life? If any of these qualities sound like you, we’ve got the position for you at Roadys.. . . . Responsibilities. . . . . . work with all departments at Roady's to develop software that powers and streamlines operations. . . . oversee front-end and back-end aspects of software/IT implementation. . . manage contractors and designers who perform third party programming projects for Roady's. Be the point of contact responsible for project completion and represent Roady's goals to external developers/designers.. . . represent and addressing technical questions and considerations as Roady's explores and prioritizes new products and projects. . . . Technical Requirements. . . . . . experience working with multiple programming languages. . . experience with web development including server-side languages (PHP or Ruby preferred) and databases (MySQL, Postgres, etc). . . . Preferred. . . . . . solid foundation in computer science, or a degree in a science, tech, engineering, or math field (or equivalent). . . 3-5 years of experience in a technically focused role. . . it's a plus if you've worked on internal administrative systems at another company in the past. . . . Salary will commensurate with experience.. "
  },
  "a10e0222-9701-11e7-99b5-3e0083d090e0": {
    "title": "Data Scientist",
    "description": ". Job Description:. . . . Booking.com is looking for data savvy professionals to join our team of data scientists. As a Senior Data Scientist, you will be working with stakeholders throughout the company to translate business needs into tangible data science projects. You will be hands on and act as a thought leader in a particular domain of expertise. You’ll also mentor new and more junior co-workers on the skills they need to build successful careers at Booking.com. If you consider yourself to be that unique hybrid of data hacker, business strategist, communicator and mentor that maintains a strong customer focus and values pragmatism over perfection, then we’d like to hear from you.. . . . The Data Scientists at Booking.com support all areas of our business: Customer Service, Accommodation Partners, Front End, Security… Even our newer products like Booking Home and Business Bookers. Your challenge will be utilizing our petabyte scale data to support business decisions and improve our products. Joining a cross functional team of developers, designers, and product owners, we invite you to help us crunch the data to ensure our place as the planet’s #1 accommodation site.. . . . . B.responsible. . . . . . . . Transform large, complex datasets into pragmatic, actionable insights.   . . . . . Leverage data to identify, quantify and influence tangible business gain.. . . . . Ability to see beyond the numbers – be the voice of data when communicating to decision makers, product owners and team leaders.. . . . . Have the capacity to thrive in our fast-paced environment, adapt quickly and take ownership of your work.. . . . . Challenge ideas and methods while working with talented, highly skilled team members.. . . . . Contribute to the growth of Booking.com through interviewing, on-boarding, mentoring and being the external ambassador of Booking.com. . . . . . B.skilled. . . . . . . . Minimum 5 years of experience in a relevant role. . . . . Masters, PhD, or equivalent experience in a quantitative field (computer science, physics, mathematics, engineering, bioinformatics, etc.). . . . . An all around data scientist: strong statistics background, experience in algorithm programming, experimentation, data visualization, machine learning, optimization and big data. . . . . Experience applying Data Science to commercial problems.. . . . . Experience collaborating cross functionally (i.e. Developers, UX Experts, Product Owners, etc.). . . . . Strong working knowledge of Python, Hadoop, SQL, R or similar technologies.. . . . . Excellent communication skills; the ability to convey complex analysis results clearly and with conviction to all stakeholder levels. . . . . Interest and experience in coaching, mentoring and technical leadership. . . . . For this position we also require strong expertise in applying at least one of the following fields or problem domains:. . . . . . Machine Learning, Reinforcement Learning, Deep Learning, Natural Language Processing, Speech Recognition, Computer Vision, Recommender Systems, Information Retrieval, Game Theory, Econometrics, Operations Research, Causal Inference / Experimentation, Forecasting, or another area of your choice that you think will help us to give our customers the best experience in the world!. . . . . B.offered. . . . . We are a performance-based company that offers career advancement and lucrative compensation, including bonuses and stock potential.  We also offer what we call the “Booking Deal” with other competitive perks and benefits.. . . . This position is open to worldwide candidates and, in the case of relocation, we will assist you with a generous relocation package, ensuring a smooth transition to working and living in Amsterdam.. "
  },
  "f127a8ca-fdd3-11e6-81a4-fe9da905eb01": {
    "title": "Data Scientist",
    "description": ". Job Description:. . . . Booking.com is looking for data savvy professionals to join our team of data scientists. You will be working with stakeholders throughout the company to generate understanding, strategy and suggest actions based on data. If you consider yourself to be that unique hybrid of data hacker, business analyst, communicator and mentor that maintains a strong customer focus and values pragmatism over perfection, then we’d like to hear from you.. . . . There are several data science teams within Booking.com each consisting of 3-8 people. All of these teams have their own scope within the business; we have Data Scientists focusing on the front end of our website, content of the pages, demands of our products, customer satisfaction and loyalty. Every team takes full responsibility for all data analysis within their area; however there is also considerable collaboration amongst teams. We often align on business goals, learn from each other and socialise after work almost every Friday.. . . . . B.responsible. . . . . . . . Transform large, complex datasets into pragmatic, actionable insights.  . . . . . Leverage data to identify, quantify and influence tangible business gain.. . . . . Ability to see beyond the numbers, be the voice of data when communicating to decision makers, product owners and team leaders.. . . . . Have the capacity to thrive in our fast-paced environment, adapt quickly and take ownership of your work.. . . . . Challenge ideas and methods while working together with talented, highly skilled team members.. . . . . . B.skilled. . . . . . . . Minimum 3 years of experience in a relevant role. . . . . Experience solving real problems using data mining techniques and with statistical rigour. . . . . Masters, PhD, or equivalent experience in a quantitative field (computer science, physics, mathematics, engineering, bioinformatics, etc.). . . . . Strong technical skills regarding data analysis, statistics and programming. Strong working knowledge of, Python, Hadoop, SQL, and/or R.. . . . . Excellent communication skills; the ability to convey complex analysis results clearly and with conviction to all levels of stakeholders. . . . . . B.offered. . . . . We are a performance-based company that offers career advancement and lucrative compensation, including bonuses and stock potential.  We also offer what we call the “Booking Deal” with other competitive perks and benefits.  IT also has monthly hackathons, training and attends/speaks at global conferences.. . . . This position is open to worldwide candidates and in the case of relocation, we will assist you with a generous relocation package, ensuring a smooth transition to working and living in Amsterdam.  We have successfully relocated 200+ IT professionals to Amsterdam in the last year!. "
  },
  "fa2381ba-fdd3-11e6-82c5-5b93b6d5fc76": {
    "title": "DevOps Engineer | Site Reliability Engineer",
    "description": ". Job Description:. . . . Booking.com is looking for a Site Reliability Engineer to join our Core Infrastructure team at our Amsterdam headquarters. As a member of one of the 30 infrastructure teams, you will be given the freedom to make meaningful and measurable improvements impacting millions of people. You will be working in one of the biggest e-commerce companies in the world, deploying code on 25,000+ servers across multiple data centers around the world!. . . . . B.responsible. . . . . . . . Design, develop and implement software that improves the stability, scalability, availability and latency of the Booking.com products;. . . . . Take ownership of one or more services and have the freedom to do what is best for our business and customers;. . . . . Solve problems occurring with our highly available production systems and build solutions and automation to prevent them from happening again;. . . . . Build effective monitoring to monitor the health of your system, and jump in to handle outages;. . . . . Build and run capacity tests to manage the growth of your systems;. . . . . Plan for reliability by designing systems to work across our multinational data centers;. . . . . Develop tools to assist the product development teams with successfully deploying 1000s of change sets every day;. . . . . Share the on-call rotation and be an escalation contact for incidents.. . . . . . B.skilled. . . . . . . . Mastery in at least one programming language, Perl and Java are a plus;. . . . . Experience with building, operating and maintaining complex and scalable systems;. . . . . Solid understanding of Software Engineering and Computer Science principles;. . . . . Solid foundation in Linux administration and troubleshooting;. . . . . Proven experience with automation. Knowledge of configuration management tools like Puppet or Chef is a plus;. . . . . Additional experience in Networking, Security or Storage is a plus;. . . . . Be able to understand and formulate meaningful business metrics;. . . . . Creative and not afraid to step outside of your comfort zone;. . . . . Fluent in the English language both spoken and written.. . . . . . B.offered. . . . . We are a performance-based company that offers career advancement and lucrative compensation, including bonuses and stock potential.  We also offer what we call the Booking Deal with other competitive perks and benefits.  The Technology department has monthly hackathons, training and attends/speaks at global conferences.. . . . This position is open to worldwide candidates and in the case of relocation, we will assist you with a generous relocation package, ensuring a smooth transition to working and living in Amsterdam.  We have successfully relocated 300+ Technology professionals to Amsterdam in the last year!. "
  },
  "cd788a5e-97cd-11e7-81ed-ae7d47995799": {
    "title": "Senior Front End Developer",
    "description": ". Job Description:. . . . At Booking.com we combine the best traits of a start-up with the resources of planet Earth’s  #1 accommodation website. We are working towards creating the ultimate travel experience, building and improving great products for both travelers and the accommodation partners.. . . . We are not afraid to experiment, think big or aim high!. . . . Based in the beautiful city of Amsterdam, our technology department is over 1500 strong.. . . . We believe that diversity makes us stronger – with over 60 different nationalities in the technology department alone, you will be able to absorb new skills and develop your career in a multicultural environment.. . . . As well as working independently, you will also be responsible for making technical decisions within a team and across teams/sub departments. Our development strategy is agile and we work in small Scrum teams of 5-7. We do several code rollouts every day, are data-driven and do extensive A/B testing on both user and partner facing platforms.. . . . . B.responsible. . . . . . . . 50% coding, 50% working with developers. . . . . Take initiative to address the larger technical needs of the product you work on. . . . . Focus on moving the business forward, be pragmatic about technology choices. . . . . Always keep the customer at the center of everything you do. . . . . Have a keen interest on the business, not just any given technical problem. . . . . Lead initiatives for improvement of development processes and business opportunities for your team’s product and the company as a whole by impacting multiple products across the business. . . . . Identify, foster, and proactively help colleagues to grow professionally, taking a significant role in onboarding new team members. . . . . Represent Booking.com values, both in the company and in the external community. . . . . Advocate a collaborative working environment – make “my ideas” into “our ideas”. . . . . Lead, manage and resolve technical or design discussions or conflicts. . . . . Contribute to the growth of Booking.com through interviewing, on-boarding, or other recruitment efforts. . . . . . B.skilled. . . . . . . . 7+ years of experience in a relevant role, preferably in a commercial environment. . . . . Expert understanding of core front-end web technologies (JavaScript, HTML, CSS). . . . . Experience with JavaScript libraries such as JQuery. . . . . Experience with templating languages. . . . . Ability to write high-performance, reusable code. . . . . Experience troubleshooting cross-browser compatibility issues. . . . . Experience with data-driven product development: analytics, A/B testing, etc. . . . . Knowledge of version control systems. . . . . Comfortable working on a command line. . . . . Excellent English communication skills, both written and verbal. . . . . . B.offered. . . . . We are a performance-based company that offers career advancement and lucrative compensation, including bonuses and stock potential.  We also offer the “Booking Deal” with other competitive perks and benefits.  The Technology department organizes exploration days and tech talks, allowing you to explore ideas outside of your everyday scope of work. We are active in the tech community and often host and attend meetups.Our employees speak at global conferences and arrange hackathons all over the world.. . . . We offer personal and professional development opportunities through internal and external training programs. Additionally we offer a conference budget to each tech employee.  . . . . You will be given the freedom to experiment and make your own decisions, impacting millions of travelers  worldwide.. . . . This position is open to worldwide candidates and, in the case of relocation, we will assist you with a generous relocation package, ensuring a smooth transition to working and living in Amsterdam.  We have successfully relocated 300+ Technology professionals to Amsterdam in the last year!. "
  },
  "db9ef0f4-bfe7-11e7-98d4-d371577aa6c0": {
    "title": "Full Stack Developer",
    "description": ". Job Description:. . . . Booking.com is looking for Full Stack Developers all around the globe!  Join us in our beautiful Amsterdam headquarters and work on planet Earths #1 accommodation website with the industry's smartest people! Our guiding principle is that by helping users we help our business. . . . . . B.Responsible. . . . . As a Full Stack Developer, you are responsible for developing world-class, complete web applications, both on the backend and frontend, for monitoring and addressing performance and security, and for developing customer-focused and scalable user experiences. You will work side-by-side with designers, product owners, copywriters and other developers to create new features, test your own ideas, and push changes live for billions of users. . . . . You will:. . . . Deliver web applications from an idea inception and validation to a scalable solution.. Collaborate with colleagues to ideate solutions for users, prioritizing based on business impact, and A/B test them.. . . . Develop new user-facing products and optimize existing ones using both client-side as well as server-side languages and technologies.. . . . . B.Skilled. . . . . Understanding the full stack of web development, from transmission of data segments between networks to presenting a well-strategized experience to users is vitally important in this role. We need self-starters who are great at solving problems, who initiate discussions, are solutions-oriented, customer focused and believe that any challenge can be scaled with the right mindset and tools. . . . . We are looking for:. . . . . . Experience working on products that impact a large user base or in an entrepreneurial startup environment.. . . Experience with data-driven product development: analytics, A/B testing, etc.. . . Self-starters with a collaborative, can-do attitude.. . . Quick delivery of end-to-end solutions to validate ideas and produce quality products.. . . A minimum of 3 years of experience with one or more general purpose programming languages, including but not limited to: Perl, Java, Python, Scala, C++ and Web development with JavaScript, HTML, CSS and HTTP.. . . Experience debugging cross-browser compatibility issues.. . . Experience  working on a command line in a Linux environment.. . . Passionate learners who arent afraid of new tools and technologies to build a great end-to-end customer experience.. . . . . B.Offered. . . . . We are a performance-based company that offers career advancement and lucrative compensation, including bonuses and stock potential.  We offer what we call the Booking Deal with other competitive perks and benefits. We have tech talks, trainings, and support you attending and speaking at global conferences.. . . . This position is open to worldwide candidates and, in the case of relocation, we will assist you with a generous relocation package, ensuring a smooth transition to working and living in Amsterdam.  We successfully relocate hundreds of IT professionals and their families to Amsterdam every year. Join us!. "
  },
  "15a1bd48-10da-11e8-8dd7-7617cf12b322": {
    "title": "Full Stack Developer",
    "description": ". Booking.com is looking for Full Stack Developers all around the globe!  Join us in our beautiful Amsterdam headquarters and work on planet Earth’s #1 accommodation website with the industry’s smartest people! Our guiding principle is that by helping users we help our business . . . . B.Responsible . . . . As a Full Stack Developer, you are responsible for developing world-class, complete web applications, both on the backend and frontend, for monitoring and addressing performance and security, and for developing customer-focused and scalable user experiences. You will work side-by-side with designers, product owners, copywriters and other developers to create new features, test your own ideas, and push changes live for billions of users. You will:. . . . Deliver web applications from an idea inception and validation to a scalable solution.. Collaborate with colleagues to ideate solutions for users, prioritizing based on business impact, and A/B test them.. Develop new user-facing products and optimize existing ones using both client-side as well as server-side languages and technologies. . . . B.Skilled  . . . . Understanding the full stack of web development, from transmission of data segments between networks to presenting a well-strategized experience to users is vitally important in this role. We need self-starters who are great at solving problems, who initiate discussions, are solutions-oriented, customer focused and believe that any challenge can be scaled with the right mindset and tools. We are looking for:. . . . . . Experience working on products that impact a large user base or in an entrepreneurial startup environment.. . . Experience with data-driven product development: analytics, A/B testing, etc.. . . Self-starters with a collaborative, “can-do” attitude.. . . Quick delivery of end-to-end solutions to validate ideas and produce quality products. . . A minimum of 3 years of experience with one or more general purpose programming languages, including but not limited to: Perl, Java, Python, Scala, C++ and Web development with JavaScript, HTML, CSS and HTTP.. . . Experience debugging cross-browser compatibility issues.. . . Experience  working on a command line in a Linux environment.. . . Passionate learners who aren’t afraid of new tools and technologies to build a great end-to-end customer experience.. . . . B.Offered  . . . . We are a performance-based company that offers career advancement and lucrative compensation, including bonuses and stock potential.  We offer what we call the “Booking Deal” with other competitive perks and benefits. We have tech talks, trainings, and support you attending and speaking at global conferences.. . . . This position is open to worldwide candidates and, in the case of relocation, we will assist you with a generous relocation package, ensuring a smooth transition to working and living in Amsterdam.  We successfully relocate hundreds of IT professionals and their families to Amsterdam every year. Join us! . . . . The hiring company Booking.com BV is the company behind Booking.com™, the market leading online accommodation reservation service in the world. Booking.com BV is looking for a Full Stack Developer in Amsterdam, the Netherlands. All references to “Booking.com\" refer to Booking.com BV.. "
  },
  "40a95a22-4e20-11e8-9701-1b7423468ecc": {
    "title": "Senior iCloud Software Engineer",
    "description": ". DESCRIPTION: Changing the world is all in a day's work at Apple. If you love innovation, here's your chance to make a career of it. You'll work hard. But the job comes with more than a few perks.. . . . Location: Apple Park, Cupertino. . . . Imagine what you could do here. At Apple, new ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish.. . . . Key Qualifications:  . . . . . . Experience designing, implementing and supporting highly scalable applications and web services. . . Experience with SQL and NoSQL database technologies. . . Multithreaded or event-driven programming. . . Excellent analytical and problem solving skills. . . Excellent written and interpersonal skills. . . Aptitude to independently learn new technologies.. . . Ability to design, develop and deploy large scale applications. . . Be able to drive a project from a simple idea to an implementation. . . Be a leader who possesses both strong programming skills and a creative, user-focused mindset. . . Ability to thrive in a multi-functional team on high profile, critical projects. . . Preferred Experience:. . . Java, C, C++. . . NoSQL databases such as Cassandra, HBase. . . Linux. . . . Description:. Consider joining a small team writing the software which forms the foundation for some of our most exciting iCloud products and services. We are looking for a deeply capable engineer who has a strong background in web services development, and who has built high-performance, scalable and extensible systems. In this highly visible position, you will collaborate with multi-functional engineering teams to define and implement some of the core backend platform frameworks and systems that will power next generation Apple web services.. . . . Education:. Bachelor's degree / PhD in computer science or equivalent. . . . Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.. . . . REQUISITION NUMBER: 113718618. COMPANY NAME: Apple Inc.. "
  },
  "3f1f876c-4e20-11e8-94e4-aed74a007765": {
    "title": "Senior Software Engineer, iTunes Editorial Tools",
    "description": ". DESCRIPTION: Changing the world is all in a day's work at Apple. If you love innovation, here's your chance to make a career of it. You'll work hard. But the job comes with more than a few perks.. . . . Imagine what you could do here. At Apple, extraordinary ideas have a way of becoming exceptional products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish..  . . . . Key Qualifications:  . . . . . . Minimum of 5 years experience in a professional programming position. . . Experience with Cocoa (macOS or iOS) and ObjectiveC/Swift.. . . Knowledge of Apple framework paradigms and commonly used patterns.. . . Being able to drive a project from a simple idea to the finished product.. . . Experience with remote data handling, REST, asynchronous programming.. . . Will to focus on details and building the best user experience.. . . Aptitude to independently learn new technologies.. . . Experience in shipping shrink-wrapped applications for macOS or iOS is a plus.. . . Experience in functional programming preferred.. . . . Description:. iTunes Editorial Infrastructure Team is seeking Senior Software Engineer to provide new tools in order to support its dynamic growth. We're looking for a Cocoa engineer to help us build the next generation macOS Cocoa tools that will drive out current and future media products. You should have experience building and shipping macOS (or iOS) applications. If you love to start with an empty canvas and build an excellent desktop application, crave building better user experiences and have the will to keep the users not only productive but happy, this is the job for you!. . . . Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants..  . . . . Education:. BSCS or equivalent work experience. . . . Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.. . . . REQUISITION NUMBER: 57498969. COMPANY NAME: Apple Inc.. "
  },
  "3ca6476e-4e20-11e8-9201-52efa277c307": {
    "title": "Senior iCloud Software Engineer",
    "description": ". DESCRIPTION: Changing the world is all in a day's work at Apple. If you love innovation, here's your chance to make a career of it. You'll work hard. But the job comes with more than a few perks.. . . . Imagine what you could do here. At Apple, new ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish.. . . . Key Qualifications:  . . . . . . Experience designing, implementing and supporting highly scalable applications and web services. . . Experience with SQL and NoSQL database technologies. . . Multithreaded or event-driven programming. . . Excellent analytical and problem solving skills. . . Excellent written and interpersonal skills. . . Aptitude to independently learn new technologies.. . . Ability to design, develop and deploy large scale applications. . . Be able to drive a project from a simple idea to an implementation. . . Be a leader who possesses both strong programming skills and a creative, user-focused mindset. . . Ability to thrive in a multi-functional team on high profile, critical projects. . . Preferred Experience:. . . Java, C, C++. . . NoSQL databases such as Cassandra, HBase. . . Linux. . . . Description:. Consider joining a small team writing the software which forms the foundation for some of our most exciting iCloud products and services. We are looking for a deeply capable engineer who has a strong background in web services development, and who has built high-performance, scalable and extensible systems. In this highly visible position, you will collaborate with multi-functional engineering teams to define and implement some of the core backend platform frameworks and systems that will power next generation Apple web services.. . . . Education:. Bachelor's degree / PhD in computer science or equivalent. . . . Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.. . . . REQUISITION NUMBER: 113718615. COMPANY NAME: Apple Inc.. "
  },
  "1860dbd2-4e0a-11e8-824d-e9573fe33079": {
    "title": "Java and C/C# Developer, Trading Systems",
    "description": ". The Bank for International Settlements is a global forum for monetary and financial cooperation and a bank for central banks. . . . Promoting global monetary and financial stability. . . . The BIS Banking IT team seeks an experienced business analyst developer specialising in trading and risk management systems. You will be working as part of a team of 10 responsible for trading applications, financial messaging and data warehousing. The Bank uses Openlink Findur with front-to-back office straight through processing.. . . . You will have excellent programming skills in both Java and C/C# and will be well versed in financial instruments and methodologies, trade-related platforms and processes. You will have experience working closely with dealers to develop customisations for trading systems. Knowledge of Oracle databases and a keen interest in new technologies and methodologies would be a plus.. . . . We offer a unique, highly rewarding, international work environment, giving you exposure to a range of complex technologies and business areas. You will receive a competitive net of tax compensation package, with full relocation and expatriate benefits available. And because of our status as an international organisation, we are able to hire globally and welcome applications from candidates of all nationalities.. . . . To find out more visit . www.bis.org/careers. . . . . Deadline for a pplications: . 27 May 2018. . "
  },
  "c20a142a-4dfe-11e8-8bba-6e4e388640ae": {
    "title": "InnoMaster IT- WiSe 2018",
    "description": ". Möchtest du dein Studium spannender und praxisnaher gestalten mit einem festen Monatsgehalt? Willst du nach deinem Bachelor schnell und reibungslos ins Berufsleben einsteigen?. . . . Dann ist unser . InnoMaster.  genau das Richtige für dich!. . . . Im Rahmen des . InnoMaster DEV.  Programms bieten wir dir die Finanzierung deines Studiums an einer ausgewählten Hochschule, eine angemessene Vergütung und wertvolle praktische Berufserfahrung, die du parallel zum Studium in verschiedenen Bereichen der IT sammeln kannst.. . . . Mit unserem Programm . InnoMaster DEV.  kannst du dein Masterstudium berufsbegleitend absolvieren. Du studierst in der Regel 6 Semester an einer Hochschule, die ein akkreditiertes berufsbegleitendes Masterstudium anbietet. Parallel arbeitest du in einer Fachabteilung bei InnoGames, in der du dein theoretisches Wissen direkt in die Praxis umsetzen kannst. Neben verantwortungsvollen Aufgaben mit fester Vergütung bieten wir dir die komplette Übernahme deiner Studiengebühren, Teilnahme an Trainings (Fachbereich, Sprachen, Soft Skills) und Unterstützung bei deiner weiteren Karriereplanung.. . . . Ort der praktischen Ausbildung ist unser Geschäftssitz in Hamburg. Die theoretische Ausbildung findet in Zusammenarbeit mit einer Hochschule beispielsweise FH Wedel statt, die ebenfalls in Hamburg oder Umgebung angesiedelt ist. Ausgewählte Studiengänge könnten zum Beispiel IT Security, Computer Science oder IT Engineering sein.. . . . Der . InnoMaster DEV.  ist auf ca. drei Jahre ausgelegt mit einer wöchentlichen Arbeitszeit von 30 – 40 Stunden pro Woche.. . . . Für weitere Fragen bezüglich des Studiums stehen wir dir gerne zur Verfügung.. . . . . Was wir von dir erwarten:. . . . . . . Guter Bachelor- oder Diplomabschluss (Notendurchschnitt 2,5 oder besser) mit Schwerpunkt auf einem IT-bezogenen Fach. . . Auslandserfahrung (mind. 1 Semester). . . Mindestens 3 Monate Arbeitserfahrung. . . Eigenverantwortliches Arbeiten, hohe Leistungsbereitschaft, Teamfähigkeit, Flexibilität. . . Gute bis sehr gute Englischkenntnisse. . . Ein hohes Maß an Eigeninitiative und Engagement sowie eine schnelle Auffassungsgabe. . . Affinität zum Internet. . . Affinität zu Games, idealerweise Online Games. . . Gute mathematische und analytische Fähigkeiten. . . . . Was wir dir bieten:. . . . . . . Angemessene Vergütung und Urlaubstage während der Vertragslaufzeit und Freistellung für Studienzwecke. . . Übernahme der Studiengebühren durch InnoGames. . . Betreuung durch einen Ansprechpartner aus der Fachabteilung sowie einen Studienreferenten aus der HR Abteilung, dadurch optimale Förderung der fachlichen und persönlichen - Auf das jeweilige Studienmodell abgestimmte Arbeitszeitgestaltung. . . Teamwork und Teamfit sind uns sehr wichtig, daher legen viel Wert auf ein Arbeitsklima in dem Kommunikation und Interkulturalität groß geschrieben werden. . . Wenn du neu in Hamburg bist, unterstützen wir dich gern mit z. B. einem Zimmer in einer Übergangswohnung. . . Kreativpausen gibt es auf der Dachterrasse, an der Baristabar, am Kicker, an den Spieleautomaten, an der Konsole, im Ruheraum, beim Eis…. . . In unserem Fitnessstudio kannst du dich austoben und dich danach an unseren kostenlosen - Getränken und frischem Obst bedienen. . . . Dich reizt die Herausforderung? Du möchtest Teil eines dynamischen Teams werden und bei uns als InnoMaster DEV Student beginnen?. . . . Dann schick uns deine aussagekräftigen Bewerbungsunterlagen (Anschreiben, CV und Zeugnisse) Präferenz der Hochschule über unser . . Online Bewerbungsformular. . .. "
  },
  "dab58272-4de3-11e8-9545-092ffb7f19b9": {
    "title": "Front End Engineer",
    "description": ". Every day, millions of people rely on WeTransfer to share their creative ideas. So, the work we do matters. Come and be a part of it. We are looking for a Front End Engineer. . . . . Front End development should be about beauty as much as it should be about performance excellence. That's why we believe in applying creative tech solutions as a means to interact with the user in a flawless manner. At WeTransfer, we work together making the user experience for millions of creative people, fast, reliable and efficient.. . . . What you’ll be doing. . . . You'll be responsible for the happiness of millions of users by implementing new features with your project team as well as ensuring our codebase stays nice and shiny. You will do this in a multidisciplinary team with passionate engineers and designers to deploy features to our users and the open source community.. . . . Who we are looking for?. . . . Above all else we value open communication and good teamwork to achieve a shared vision. We are looking for someone who has a passion for making beautiful web experiences, it's highly skilled with HTML, CSS and JavaScript, and it's not afraid of tools and cool frameworks.. . . . Even though we are heavy users of React and Redux libraries, we prefer to work with smart people that understand that tools are just tools, not the main goal, and can find the most suitable solution for any given problem. We also think that quality is a must, and we set the bar pretty high, but a pragmatic approach is desired to an over-engineered solution. Making our users happy is our best quality metric.. . . . Some Ruby experience is desired as well. We don't build a wall around our APIs, so we expect that you dig into our backend systems and make the necessary changes to solve your problem. If you already have experience on other languages, but not Ruby, we will help you to learn. Because we all love Ruby.. . . . Last but not least, with more than 40 million unique users a month, data drives our decisions. If you have experience with analytical tools, data collection, A/B tests, etc... you are more than welcome to share it with us.. "
  },
  "409714aa-4de1-11e8-8546-20a952dfe08d": {
    "title": "Senior C++ Developer",
    "description": ". . Senior C++ Developer. . . . . Werken aan innovatieve oplossingen die onmisbaar zijn voor iedereen en dus ook voor jou als reiziger? Als Senior C++ Developer bij InTraffic lever jij een waardevolle bijdrage aan de reizigerservaring!. . . . . . Hoe? Door complexe technische vraagstukken op te lossen waarbij C++ geen geheimen meer voor jou heeft.. . . . . . . Waarom?.  Om de veiligheid van ons systeem te waarborgen om ernstige gevolgen en situaties voor de treinomloop te voorkomen.. . . . . . . Waar?.  Bij InTraffic in Nieuwegein, dé IT-specialist op het gebied van verkeer en vervoer.. . . . . . . Met wie?.  Je werkt in een scrumteam. Onze teams variëren van 3 tot 9 professionals.. . . . . . . Meester in mobiliteit. . . Wij zijn dé IT-specialist op het gebied van verkeer en vervoer en bouwen aan de mobiliteitstechnologie van de toekomst. Hier zijn we trots op!. . . . Onze procesleidingsystemen en applicaties voor verkeersleiding zorgen ervoor dat duizenden reizigers elke minuut van de dag doorstromen naar hun bestemming. Dit doen we door bijvoorbeeld duizenden seinen op het spoor aan te sturen en te zorgen dat dit veilig en vlekkeloos gebeurt. We voorspellen met inframonitoringssoftware wanneer preventief onderhoud nodig is en houden reizigers op de hoogte met real-time informatie. Wij zijn hierin verantwoordelijk voor het verzorgen van 24/7 support.. . . . . Een van onze grootste klanten spreekt waardering uit voor onze 24/7 support: “Er zijn vijf mensen in Nederland die ervoor zorgen dat de treinen blijven rijden.”. . . . . . Jouw rol als Senior C++ Developer. . . Krijg jij energie van een complexe uitdaging? Weet je als geen ander alle puzzelstukken op de juiste plek te leggen en kent C++ geen geheimen voor jou? Dan ben jij de Senior C++ Developer die wij zoeken. Met jouw oplossingen draag je namelijk direct bij aan een werkend en steeds slimmer openbaar vervoer in Nederland. De technische vraagstukken waarmee je je bezig gaat houden zijn vooral gericht op Linux en C++.. . . . Als C++ goeroe ben jij in staat om een trekkersrol te vervullen en je collega’s mee te nemen in de materie. Je levert samen met het team een belangrijke bijdrage aan een van de grootste en meest complexe informatiesystemen van Nederland, namelijk Procesleiding (PRL). Dit is een bedrijfkritisch systeem en vereist 24/7 beschikbaarheid. PRL is ontwikkeld op oude hardware en een verouderd besturingssysteem en we zijn begonnen met het maken van een moderniseringsslag. De veiligheid van het systeem waarborgen is namelijk essentieel om ernstige gevolgen en situaties voor de treinomloop te voorkomen.. . . . . Jouw taken. . . Wij werken binnen onze projecten volgens de Agile methode. De teams variëren van 3 tot 9 professionals, samen met je team werk je dedicated aan één project.. . . . . In deze veelzijdige rol zijn dit je kerntaken:.   . . . . . . Analyseren en oplossen van de meest complexe vraagstukken met een sterk technisch karakter;. . . Ontwerpen en ontwikkelen van kwalitatief hoogwaardige software;. . . Het voorkomen of oplossen van problemen met als doel dat de treinenloop niet verstoord wordt;. . . Kennis overdragen en sturing geven aan je collega’s.. . . Een voorbeeld van zo’n project is Procesleiding Rijwegen.. . . . . Wat breng je mee?. . . Het ophalen van de juiste informatie en de vertaalslag kunnen maken naar concrete acties, is aan jou goed besteed. Je bent een teamplayer en samen met je collega’s zijn jullie gedreven om meters te maken. Je brengt structuur aan en hier zet jij je doorzettingsvermogen en geduld voor in.. . . . . . Je herkent je in de volgende criteria:. . . Je bent in het bezit van een afgeronde relevante hbo- of wo-opleiding;. . . Je hebt minimaal 7 jaar kennis van en ervaring met C++ en Linux;. . . Kennis van Pascal en TIBCO/EMS is een pré;. . . Jij bent analytisch sterk en houdt van een uitdagende puzzel. Als niemand er meer uitkomt, word jij juist enthousiast;. . . Je leert snel in complexe materie;. . . Defensief programmeren is voor jou bekend terrein;. . . Je hebt voldoende affiniteit en ervaring met scrum.. . Note: full proficiency in Dutch is mandatory. . . . . . Wij stimuleren jouw persoonlijke en professionele ontwikkeling. . Wij stimuleren onze mensen om zichzelf te blijven ontwikkelen, daarnaast zijn er voldoende mogelijkheden om intern door te groeien. Ter ondersteuning bij je ontwikkeling bieden we je een boeken- en opleidingsbudget aan en je hebt de beschikking over een coach. Je kunt deelnemen aan een van onze vakgroepen en je kunt je kennis verbreden door het bezoeken van vak gerelateerde evenementen.. . . . . Wij vragen veel en daar staat ook veel tegenover. . . Binnen een groeiend bedrijf met inspirerende opdrachten en een hele prettige werksfeer bieden we je de volgende arbeidsvoorwaarden:. . . . . . Een jaarcontract, maar altijd met de intentie tot een vast dienstverband;. . . Marktconform salaris met een vaste 13e maand;. . . 30 vakantiedagen;. . . Een persoonlijk ontwikkel- en boekenbudget;. . . Mogelijkheid tot flexwerken;. . . Flexibel mobiliteitsbudget op maat.. De meeste projecten voeren wij uit binnen onze eigen kantoren in Nieuwegein. We voeren ook projecten uit waarbij het team op klantlocatie werkt. Tenslotte zetten we professionals in op strategische plekken bij onze opdrachtgevers.. . . . . Werken @ InTraffic: Passie en plezier. . . Met 180 medewerkers werken wij dagelijks met plezier aan innovatieve technologische oplossingen voor onze opdrachtgevers. Wij gaan gretig complexe uitdagingen aan, het liefst projecten die anderen als toekomstmuziek bestempelen. We adviseren hoe klanten vervoersprocessen kunnen innoveren, creëren toekomstbestendige software en integreren onze systemen naadloos in hun bestaande informatieketens. We testen, testen en testen opnieuw, en onderhouden onze systemen zelf zodat alles perfect werkt en blijft werken.. . . . Onze medewerkers kiezen voor onze organisatie vanwege de complexiteit en diepgaande techniek waar wij aan werken, relevante maatschappelijke thema’s en de lange doorlooptijd van onze projecten.. . . . Het is belangrijk om elke dag met plezier naar je werk te gaan. We bieden een leuke en ergonomisch verantwoorde werkomgeving en uiteraard maak je gebruik van de juiste hulpmiddelen die nodig zijn om je functie goed uit te kunnen voeren. We hebben diverse mogelijkheden voor flexibel werken en een loungehoek om te genieten van een verse kop koffie of je lunch. Er is voldoende plek om met je collega’s te sparren over het vakgebied of je ervaringen te delen over een nieuwe game die je hebt ontdekt bijvoorbeeld. Voor de sportievelingen is er de mogelijkheid om deel te nemen aan een van onze sportactiviteiten. Ook organiseren wij geregeld een borrel, een BBQ en pakken wij jaarlijks uit tijdens ons personeelsfeest.. . . . . Ben jij onze nieuwe Senior C++ Developer?. . . We hebben nog veel meer te vertellen. Wil je erachter komen of deze rol en onze organisatie bij jou passen? Solliciteer direct via deze link: . Klik hier voor het sollicitatieformulier!.   . . . . Of neem contact op met Melanie Vink, corporate Recruiter, op 088 345 5000 of via . melanie.vink@intraffic.nl. .. . . . . . Acquisitie naar aanleiding van deze vacature wordt niet op prijs gesteld.. . . . . . Trefwoorden: Vacature, Fulltime, Utrecht, Software developer, C++ ontwikkelaar.. "
  },
  "428e51e4-4ddf-11e8-8a07-67eb144e5584": {
    "title": "Fullstack JavaScript developer",
    "description": ". At Paradox, we are focused on bringing value to our community by creating groundbreaking features for both players and game developers. If you are a passionate developer who would like to work at a successful game company full of people passionate in technology &amp; games, read on and learn how you can be part of the fun and talented DevOps team!. . . . We are now looking for several developers to work with the various online &amp; offline technologies that are used in Paradox games and surrounding platforms. The DevOps team is in charge of a wide set of features and products including the Paradox Account, cross-platform multiplayer technology, social/player features (leaderboards, cloud saves, etc.), the Paradox Plaza store, the forums, as well as the game SDK that exposes these features to our games, and many others!. . . . In this role you will make day to day key decisions, and together with the rest of the team develop groundbreaking features for both players and game developers. You will be a key member in designing, building, and shaping the effort in realizing features which enrich our Paradox ecosystem. This also means that you will be working closely with all of the Paradox game development studios, as well as the publishing organization, in order to maximize the consumption of our services to guarantee we continue delivering Paradox signature experiences.. . . . Responsibilities. . . . Frontend, backend, and desktop JavaScript development. Build &amp; maintain JavaScript services &amp; cloud functions. Build &amp; maintain internal JavaScript libraries. Optimize frontend performance &amp; payload size. Cross-device/platform styling consistency. Advise &amp; follow on best practices. Needed special skills &amp; technologies. . . . ReactJS (or similar SPA). NodeJS. RESTful API familiarity. Database querying (SQL and NoSQL variants). Backend data caching. Realtime data handling (WebSockets). Bonus point skills &amp; technologies. . . . Electron. GraphQL. Cloud Infrastructure Experience (AWS). Security (e.g. OWASP). Build &amp; deployment pipeline experience. CI/CD experience. Offline handling. Message/event queues (SQS, RabbitMQ, etc.). Load balancing &amp; multithreading. Worker node orchestration. Generally required qualifications. . . . 3+ years of professional experience. Bachelor degree or comparable professional experience. Comfortable with a range of programming languages and technologies. Experience with agile development. Proficient with code versioning tools, such as Git. We believe you are a service-minded, driven, and explorative individual; you don't have problems with making decisions and handling the responsibilities that comes with it. You are used to solving problems and working independently as well as in a group. Your role in a team is flexible and can include being the one who identifies viable solutions and implements appropriate solutions. Your English communications skills, both verbal and oral, are excellent and are backed by patience in taking the time to understand others.. . . . Practical information. . . . Scope: Full time and permanent. . . . Reports to: Programming Manager. . . . Location: This position is based in Stockholm. . . . If you think that this description matches your background, we highly encourage you to apply as soon as possible as we will interview candidates continuously for this position. In your application, please show us why your previous experiences and skills would work for this role and why you are interested in working at Paradox. If you don't match all the requirements, please demonstrate how your passion, attitude, and interest in Paradox might compensate for this.. . . . Since we strive for a more even gender distribution we highly encourage women to apply to this role.. "
  },
  "f711f746-4ddb-11e8-8ba9-0bea8d2448e9": {
    "title": "C#/C++ Developer",
    "description": ". At Paradox, we are focused on bringing value to our community by creating groundbreaking features for both players and game developers. If you are a passionate developer who would like to work at a successful game company full of people passionate in technology &amp; games, read on and learn how you can be part of the fun and talented DevOps team!. . . . We are now looking for several developers to work with the various online &amp; offline technologies that are used in Paradox games and surrounding platforms. The DevOps team is in charge of a wide set of features and products including the Paradox Account, cross-platform multiplayer technology, social/player features (leaderboards, cloud saves, etc.), the Paradox Plaza store, the forums, as well as the game SDK that exposes these features to our games, and many others!. . . . In this role you will make day to day key decisions, and together with the rest of the team develop groundbreaking features for both players and game developers. You will be a key member in designing, building, and shaping the effort in realizing features which enrich our Paradox ecosystem. This also means that you will be working closely with all of the Paradox game development studios, as well as the publishing organization, in order to maximize the consumption of our services to guarantee we continue delivering Paradox signature experiences.. . . . Responsibilities. . . . Software architecture. Game SDK development. REST API / web service integrations. 3rd party library/SDK integrations. Code optimization &amp; refinement. Planning, implementation, packaging, documentation, and delivery of our SDK. . . . Needed special skills &amp; technologies. . . . C++ and C# proficiency. Desktop application development. Multi-platform build development (OSX, Linux, Windows). Steam SDK (or similar). . . . Bonus point skills &amp; technologies. . . . Build and release management. Unity or Unreal game engine. Mobile development experience (Android &amp; iOS). Game console development experience. . . . Generally required qualifications. . . . 3+ years of professional experience. Bachelor degree or comparable professional experience. Comfortable with a range of programming languages and technologies. Experience with agile development. Proficient with code versioning tools, such as Git. We believe you are a service-minded, driven, and explorative individual; you don't have problems with making decisions and handling the responsibilities that comes with it. You are used to solving problems and working independently as well as in a group. Your role in a team is flexible and can include being the one who identifies viable solutions and implements appropriate solutions. Your English communications skills, both verbal and oral, are excellent and are backed by patience in taking the time to understand others.. . . . Practical information. . . . Scope: Full time and permanent. . . . Reports to: Programming Manager. . . . Location: This position is based in Stockholm. . . . If you think that this description matches your background, we highly encourage you to apply as soon as possible as we will interview candidates continuously for this position. In your application, please show us why your previous experiences and skills would work for this role and why you are interested in working at Paradox. If you don't match all the requirements, please demonstrate how your passion, attitude, and interest in Paradox might compensate for this.. . . . Since we strive for a more even gender distribution we highly encourage women to apply to this role.. "
  },
  "949e5a7a-4d57-11e8-9178-6a21e83a3735": {
    "title": "Engineering Manager, Vault",
    "description": ". Note for GitHub jobs: This manager works with the team building . https://github.com/hashicorp/vault. , among other things.. . . . Our Organization. . . . At HashiCorp, we value top-notch collaboration and communication skills, both among internal teams and in how we interact with our users. We take care to balance and be responsive to the needs of our open source community as well as our enterprise level customers.. . . . Engineering at HashiCorp is largely a remote team. While prior experience working remotely isn't required, we are looking for team members who perform well given a high level of independence and autonomy.. . . . Our Products. . . . We build Consul, Nomad, Vault, Terraform, Vagrant, and Packer. Alongside of that, we deploy enterprise products for each in a variety of different ways: licensed and unlicensed binaries, appliances to public cloud platforms, and hosted SaaS platforms. Our products help organizations of all sizes run any infrastructure for any application.. . . . This Position. . . . This is an engineering management role focused on our . Vault.  product line, managing the Vault engineering team and overall product delivery.  Our Vault engineering team is working to provide a fantastic and broadly used secrets tool for businesses and individuals handling all sizes and types of infrastructure.  Our Vault customer base is growing rapidly and Vault is foundational for them to secure their applications.  The highly technical team also provides development support and guidance to external vendor development teams and the entire Vault community across a range of technologies.. . . . HashiCorp views management and technical leadership as two tracks, with a highly technical background being a requirement for both. This role is uniquely technical given the nature of the product, it’s criticality in securing businesses and interaction with strategic partners and vendors.  Given this unique situation, it is expected that applicants would be comfortable playing a mix of roles. In order of priority, this would include management and coaching, advocacy for the team and with technical partners, and individual contribution.. . . . In this role, you can expect to:. . . . . . Support the career growth for individuals on a team building and contributing to Vault in a busy open source community. . . Work with some of the largest infrastructure providers to support strategic relationships with HashiCorp. . . Contribute to our growing engineering management team and culture. . . Hire within the US, UK, Canada, and Europe to grow your team. . . Ensure the on-time release of well tested and reliable code used to secure mission critical services. . . Manage a team of subject matter experts with unique and individual expertise in security. . . . You may be a good fit for our team if you have:. . . . . . An interest in building a support structure for engineers to help them succeed at their job. . . Models and supports a positive and healthy work life balance. . . A strong and nimble set of technical skills across technologies the team interacts with, such as commonly used security technologies. . . An interest in a management career track in a technical context. . . Great communication skills for working across the organization, capable of building strong relationships with peers and leadership. . . You have experience operating and maintaining production systems in a Linux and public cloud environment. . . You have experience managing a remote distributed team of reasonable size. . . . In your cover letter, please describe why you're interested in working at HashiCorp, and on the Vault team in particular. . . . . . At HashiCorp, we are committed to hiring and cultivating a diverse team. If you are on the fence about whether you would be successful working with us, please apply anyway!. . "
  },
  "776c9e60-4ca0-11e8-9860-71a43ad1cbdd": {
    "title": "Business Intelligence Data Engineer ",
    "description": ". The Data Engineer will be responsible for the scripts and processes required to extract, transform, clean and move data and metadata so they can be loaded into a data warehouse, data mart or operational data store. Reads, analyzes and digests what the company wants to accomplish with its data, and designs the best possible ETL process around those goals.. . . . The Data Engineer will be responsible to gather, collect, store, do batch or real time processing on the data and serve it via an API for open and easy access. The Data Engineer will also be responsible for evaluating the many Big Data tools available, incorporating them into the data platform and educating others on how best to use them.. . . . ESSENTIAL FUNCTIONS. . . . . . Work with business requirements to identify and understand source data systems; provide resolutions to all data issues and coordinate with data analyst to validate all requirements, perform interviews with all users and developers.. . . Map source system data to data warehouse tables. . . Develop and perform tests and validate all data flows and prepare all ETL processes according to business requirements and incorporate all business requirements into all design specifications.. . . Define and capture metadata and rules associated with ETL processes. . . Adapt ETL processes to accommodate changes in source systems and new business user requirements. . . Collaborate with all developers and business users to gather required data and execute all ETL programs and scripts on systems and implement all data warehouse activities and prepare reports for same.. . . Provide support and maintenance on ETL processes and documentation. . . Build partnerships across the application, business, and infrastructure teams. . . Strive to continuously improve the software delivery processes and practices. . . Champion company standards and best practices . . . . Additional Responsibilities. . . . . . Accountable for properly following all IT standards, processes and methodologies as applicable including but not limited to Quality Assurance (QA), . . . Other responsibilities and accountabilities may be assigned based on business and organization needs.. Varied. . . . TRAVEL EXPECTATIONS. . . . . . Regular travel requirements (20% - 35%). . . . MINIMUM QUALIFICATIONS . Education/Certification. . . . . . Four year college  in a quantitative field such as Biostatistics or Computer Science or commensurate work experience. . . . Experience. . . . . . MUST HAVE experience with AWS (Redshift, S3, or Tools such as GLUE) . . . MUST HAVE at least three (3) years of industry experience as a Data Engineer or related specialty (e.g. Software Engineer, Business Intelligence Engineer, and Data Scientist) with extensive professional experience and a proven track record in a role focused on understanding, manipulating, processing and extracting value from large disconnected datasets.. . . Strong proficiency in SQL. . . Expert in ETL . . . Creative in finding new solutions and designing innovative methods, systems and processes. . . Desire to create and build new predictive/optimization tools for structuring datasets . . . . Preferred Qualifications . . . . . . Strong analytic skills for working with unstructured datasets . . . Strong project management and organizational skills, experience working on complex initiatives with cross-functional teams in a dynamic environment . . . Experience with connecting data sets to data visualization tools and creating reports using Tableau and Power BI. . . . ESSENTIAL KNOWLEDGE, SKILLS AND ABILITIES. . . . . . Business Acumen. . . Business Alignment. . . Requirements Definition   Proficient. . . Oral and Written Communication Skills. . . Operational Process Flows . . . Analytical skills. . . "
  },
  "eea00520-3487-11e8-9403-ba1a7cdf47b1": {
    "title": "Game Server Engineer",
    "description": ". N3TWORK builds fun, engaging, free to play games for iOS and Android. We are looking for talented game server engineers to join our small, focused team of experienced veterans to build scalable game servers.. . . . RESPONSIBILITIES. . . . . . Work with the server engineering team to help design and build successful, scalable services that back free to play games on iOS and Android.. . . Implement reusable server side systems that drive game features.. . . Help build web based tools used by game designers and producers to operate games.. . . Write and maintain quality, readable code.. . . Collaborate with game teams, designers and artists to bring our work to life.. . . . REQUIREMENTS. . . . . . 3+ years experience in Java, Python or Ruby.. . . Deep knowledge of data structures, algorithms and design patterns and how to apply them to the problem at hand.. . . Deep experience with secure, scalable RESTful API design and development for mobile games.. . . Experience with database design and scaling for write-heavy workloads.. . . Experience operating production services in AWS or another cloud environment.. . . Ability to identify and correct performance bottlenecks on a live system.. . . Solid understanding of Unix/Linux.. . . Understanding of and interest in successful free to play game design and development.. . . Curiosity that drives you to continually learn new things.. . . . BONUS. . . . . . Experience with Dropwizard.. . . Experience with DynamoDB or other NoSQL datastores at scale.. . . Experience with Go.. . . "
  },
  "7f854636-4c8e-11e8-89a6-641eafe1cf00": {
    "title": "Mobile Developer at Creatubbles",
    "description": ". We are seeking to change the world. Literally.. . . . Creatubbles is a safe-for-all-ages social platform focused on creativity. On top of the Creatubbles platform that now has users in more than 50 countries around the world, the “Share with Creatubbles” partner solution provides out-of-the-box safe social community engagement for brands of all sizes. With strong operational connections in the East and the West, Creatubbles presents a unique opportunity to be a part of a truly global team.. . . . In a world with information ubiquity, rapid developments in intelligent technologies, and geo-political fluidity and fragility, it is clear that human creativity with depth and empathy amongst our future generations is becoming increasingly important. We see human creativity as a critical life skill that can and must be developed, nurtured, and celebrated. Creatubbles is being developed as a platform to do just this.. . . . Creatubbles seeks to connect the dots between natural human creativity, technology, and business to inspire and bring out the best that exists in all of us, including our youngest and most vulnerable.. . . . . Job Description. . . . . We are looking for a Mobile Developer who is fundamentally excited about this challenge and who has the skills, experience, and understanding required to help make our dream a reality.. . . . As a Mobile Developer at Creatubbles you will work closely with our product manager and design team members. Your primary goals will be to develop new, awesome features for users around the world. You are passionate about the potential of mobile technology to transform the lives of creative minds around the world.. . . . . QUALIFICATIONS / ABOUT YOU. . . . . . DEMONSTRATED EXPERIENCE. . . . . . . Demonstrated experience building complex applications for iPhone or iPad and are a guru in using one or more object oriented languages (Objective-C, C++, Swift, Java, Kotlin, C#, …) . . . You have a shipped a range of popular consumer focused apps (please include references in your cover letter) . . . Experience with data-driven product development: analytics, A/B testing, etc. . . . Experience with code bases, including API design techniques . . . Experience building in the iPhone SDK . . . Experience with multithreading programming . . . Experience writing unit tests and testable code (jUnit, Appium, …) . . . Experience in building high quality UI and working with graphic designers . . . Able to dive into complex complex problems and arrive at well-designed solutions. . . . . REQUIRED COMPETENCE AND SKILLS. . . . . . . Ability to work independently and implement product features from start to finish . . . You have experience in a startup or growth stage company . . . Team player who brings out the best in those who work with you . . . Excellent written and verbal English language communication skills . . . Data driven understanding of product features . . . Highly pro-active with an entrepreneurial spirit. . . . . A COMPATIBLE MINDSET AND APPROACH. . . . . . . Empathetic, and energetic, and intellectually curious . . . Passion for great user experiences and have a demonstrated track record of developing features that users love (and which drive KPI’s!) . . . Confidence to explore and try with the humility to ask questions . . . Understanding of and fundamental interest in the trends and disruptive impacts of technology and how they can be used to innovate for our users and partners . . . Passion for problem solving . . . Grit and perseverance . . . Ability to see what Creatubbles not just for what it is but what it can be with the understanding and practical ability to bridge the gap between the two systematically. . . . . BONUS QUALIFICATIONS. . . . . . . Deep understanding of the mechanics and growth dynamics inherent in successful social platforms . . . Experience working on large scale social platforms, creativity applications or platforms, and/or on innovative 21st century education / learning solutions. . . . . COMPENSATION. . . . . . . Compensation package and structure negotiable based on experience. . . "
  },
  "d4ce5b1a-4c8d-11e8-8316-de2ea6887ec8": {
    "title": "Back-end Developer at Creatubbles",
    "description": ". We are seeking to change the world. Literally.. . . . Creatubbles is a safe-for-all-ages social platform focused on creativity. On top of the Creatubbles platform that now has users in more than 50 countries around the world, the “Share with Creatubbles” partner solution provides out-of-the-box safe social community engagement for brands of all sizes. With strong operational connections in the East and the West, Creatubbles presents a unique opportunity to be a part of a truly global team.. . . . In a world with information ubiquity, rapid developments in intelligent technologies, and geo-political fluidity and fragility, it is clear that human creativity with depth and empathy amongst our future generations is becoming increasingly important. We see human creativity as a critical life skill that can and must be developed, nurtured, and celebrated. Creatubbles is being developed as a platform to do just this.. . . . Creatubbles seeks to connect the dots between natural human creativity, technology, and business to inspire and bring out the best that exists in all of us, including our youngest and most vulnerable.. . . . We are looking for a Back-end Developer who is fundamentally excited about this challenge and who has the skills, experience, and understanding required to help make our dream a reality.. . . . As a Back-end Developer at Creatubbles you will be responsible for managing the interchange of data between the server and our users. Your primary focus will be development of all server-side logic, definition and maintenance of the central database, and ensuring high performance and responsiveness to requests from the front-end. A solid understanding of front-end technologies is therefore necessary as well.. . . . . QUALIFICATION / ABOUT YOU. . . . . . DEMONSTRATED EXPERIENCE. . . . . . . Experience working in a few companies/environments on at least 2-3 different products (for at least 1-2 years each) building complex user facing applications . . . Integration of user-facing elements developed by front-end developers with server side logic . . . Building reusable code and libraries for future use . . . Optimization of applications for maximum speed and scalability . . . Securely storing and processing personal information is extremely important to us and our users. You have extensive proven experience dealing with this. . . . Design and implementation of data storage solutions. . . . . REQUIRED COMPETENCE AND SKILLS. . . . . . . Basic understanding of front-end technologies and platforms, such as JavaScript, HTML5, and CSS3 . . . Understanding accessibility and security compliance . . . User authentication and authorization between multiple systems, servers, and environments . . . Integration of multiple data sources and databases into one system . . . Management of hosting environment, including database administration and scaling an application to support load changes . . . Understanding differences between multiple delivery platforms such as mobile vs desktop, and optimizing output to match the specific platform . . . Creating database schemas that represent and support business processes . . . Implementing automated testing platforms and unit tests . . . You are an API wizard, nothing less than a Rails guru, and are passionate about data algorithms, databases, and API’s but also know your with javascript, html, and css . . . Scalability issues and performance improvements are what you like to eat for breakfast! . . . Proficient understanding of code versioning tools, such as Git . . . Proficient understanding of OWASP security principles. . . . . A COMPATIBLE MINDSET AND APPROACH. . . . . . . You insist on clean code that leads to beautiful user interfaces . . . You have experience with data-driven product development: analytics, A/B testing, etc. . . . Empathetic, and energetic, and intellectually curious . . . Passion for great user experiences and have a demonstrated track record of developing features that users love (and which drive KPI’s!) . . . Confidence to explore and try with the humility to ask questions . . . Understanding of and fundamental interest in the trends and disruptive impacts of technology and how they can be used to innovate for our users and partners . . . Passion for problem solving . . . Grit and perseverance . . . Ability to see what Creatubbles not just for what it is but what it can be with the understanding and practical ability to bridge the gap between the two systematically. . . . . BONUS QUALIFICATIONS. . . . . . . Deep understanding of the interactions and growth dynamics inherent in successful social platforms . . . Experience working on large scale social platforms, creativity applications or platforms, and/or on innovative 21st century education / learning solutions. . . . . COMPENSATION. . . . . . . Compensation package and structure negotiable based on experience. . . "
  },
  "3e405d78-1b29-11e8-88c9-b4b578163b5c": {
    "title": "Senior Mobile Unity/ C# Developer",
    "description": ". As a Senior Mobile Unity/ C# Developer you will be part of our agile, cross-functional and international development team. You will drive the development of new features as well as maintain and improve the current code of our new games.. . . . . Your mission:. . . . . . . Conception and development of mobile apps for our games, based on C# and Unity3D. . . Continuous refinement and optimization of existing mobile apps. . . Conception of APIs, tools, and workflows to optimize the interdisciplinary work. . . Ensuring a high product quality, together with Quality Assurance. . . Foster a culture of sharing knowledge, best practices and standards. . . . . Your profile:. . . . . . .  Degree in computer science or business/ media information technology or relevant professional experience. . . At least 4 years of experience in using Unity or other 3D game engines like Unreal or CryEngine. . . Very good knowledge of object-oriented programming in C#. . . Professional experience in agile software development (e.g. SCRUM or Kanban). . . Excellent understanding of software architecture, design and test-driven development. . . Deep understanding of the mobile platforms and their performance optimization strategies. . . Profound experience of writing shaders using GLSL, HLSL or Cg. . . Experience in development of UI, audio, animation systems and good CPU and GPU optimization skills as a plus. . . Excellent English language skills. . . Willingness to continuously learn and improve. . . Flexible and an independent way of working. . . Passion for computer games and the games industry. . . . . Why join us?. . . . . . . Shape the success story of InnoGames with a great team of driven experts in an international culture. . . Competitive compensation and an atmosphere to empower creative thinking and strong results. . . Exceptional benefits ranging from flawless relocation support to company gym, smartphone or tablet of your own choice for personal use, roof terrace with BBQ and much more. . . . Would you like to become part of a dynamic team and work as a Senior Mobile Unity/ C# Developer with us? Then we look forward to receiving your application (cover letter, CV, and references) as well as your salary expectations and earliest possible starting date through our online application form at innogames.com. Your contact person for this job offer is Elena Zhdanova.. . . . InnoGames, based in Hamburg, is one of the leading developers and publishers of online games with more than 200 million registered players around the world. Currently, more than 400 people from 30 nations are working in the Hamburg-based headquarters. We have been characterized by dynamic growth ever since the company was founded in 2007. In order to further expand our success and to realize new projects, we are constantly looking for young talents, experienced professionals, and creative thinkers.. "
  },
  "fb6a544e-1b29-11e8-8062-e14cc69ae428": {
    "title": "Java Software Developer for Marketing",
    "description": ". As a Java Software Developer, you will join our agile, cross-functional team to advance the development of our next-generation marketing tools and contribute with your knowledge of software architecture. Together as a team, we are proud to early adopt new features in advertising and always strive for innovations in products and technologies.. . . . . Your mission:. . . . . . . Work closely with our marketing department to shape and design various marketing tools and help us to use the social media budget more efficiently. . . Connect our software with big data and business intelligence services to create automated marketing processes. . . Continuously improve our backend services with your knowledge of software architecture and high-quality code. . . Contribute as a productive member of an agile development team in all phases of the development lifecycle. . . . . Your profile:. . . . . . . Degree in Computer Sciences, Business Information Systems or similar. . . Several years of professional experience in software development. . . Background in object-oriented programming in Java and openness for new programming paradigms. . . Software development with Spring, the UNIX command line is something you really enjoy and also feel comfortable to use SQL, GIT, and Continuous Delivery. . . Being a backend geek, you also sometimes like to switch to the frontend side with JavaScript and HTML and do not fear the work with third-party APIs. . . Solid experience in using various methods in software design and automated testing to guarantee and improve code quality in compliance with the company standards. . . Interest in relevant business processes and the product you create. . . Excellent English language skills. . . Interest in the state-of-the-art technology. . . . . Why join us?. . . . . . . Shape the success story of InnoGames with a great team of driven experts in an international culture. . . Competitive compensation and an atmosphere to empower creative thinking and strong results. . . Time for your personal and professional development and possibilities to join both internal and external events and conferences to gain expert knowledge in the relevant areas . . . Exceptional benefits ranging from flawless relocation support to company gym, smartphone or tablet of your own choice for personal use, roof terrace with BBQ and much more. . . . Would you like to become part of a dynamic team and work as a . Java Software Developer.  with us? Then we look forward to receiving your application (cover letter, CV, and references) as well as your salary expectations and earliest possible starting date through our online application form at innogames.com. Your contact person for this job offer is . Elena Zhdanova. .. . . . InnoGames, based in Hamburg, is one of the leading developers and publishers of online games with more than 200 million registered players around the world. Currently, more than 420 people from 30 nations are working in Hamburg and Düsseldorf. We have been characterized by dynamic growth ever since the company was founded in 2007. In order to further expand our success and to realize new projects, we are constantly looking for young talents, experienced professionals, and creative thinkers.. "
  },
  "f0204a80-4c57-11e8-953f-45c6f7e56dd0": {
    "title": "DevOps Engineer",
    "description": ". . Wij zoeken. . . . . Een gedreven junior of medior DevOps Engineer. Onderzoekend, nieuwsgierig, kritisch en vasthoudend zijn eigenschappen die bij je passen, maar je blijft een teamspeler. Je bent leergierig en resultaat gedreven en je bent bekend met de laatste technieken. Door jouw DevOps kwaliteiten breng jij onze levering van diensten op een hoger niveau. Je hebt kennis van meerdere programmeertalen, open source libraries en frameworks. Scrum is niet je doel maar Agile is hoe je werkt en denkt. Je beschikt over een analytisch denkvermogen en bent communicatief vaardig. Je voelt de drang om dingen beter te maken, niet alleen technisch maar ook functioneel.. . . . . Dit is het team. . . . . Je bent onderdeel van het Multi Disciplinaire Team dat zorgt draagt voor de diensten van de Universiteitsbibliotheek. Dit is een gevarieerd pakket aan IT diensten. Diensten die onderzoekers en studenten snel en gemakkelijk toegang bieden tot wetenschappelijke informatie, diensten voor de archivering en ontsluiting van wetenschappelijke output in de vorm van onderzoeksdata, publicaties en projectinformatie, diensten ter ontsluiting van digitale onderwijsmaterialen en centrale zoeksystemen voor de ontsluiting van informatie binnen Wageningen University &amp; Research.. . . . DevOps is onze filosofie: dat betekent dat we gezamenlijk verantwoordelijk zijn voor het bouwen en draaiend houden van de applicaties. Uiteraard werken we Agile en lever je input zodat de Product Owner de prioritering van de backlog met het team kan doen; Onze focus ligt op ontwikkeling! Dat betekent dat onze kwaliteit top moet zijn om het beheer zo efficiënt mogelijk te kunnen uitvoeren. Onze Continuous Delivery aanpak helpt jou om kwalitatief goede code op te leveren. We gaan graag in discussie met de Product Owner om goed beargumenteerd technicals voorrang te geven op functional requirements, maar vooral wordt je gemotiveerd door de functionaliteit die we leveren aan onze eindgebruikers.. . . . . Onze techniek. . . . . We werken in een omgeving waar we onze ontwikkelingen doen op basis van Open Source technologie, maar ook te maken hebben met aangekochte systemen, waarmee we koppelingen realiseren. Onze Ubuntu Linux servers met Apache web server en Apache Solr vormen de backbone voor onze diensten. We werken met Git in ons ontwikkelproces. We maken gebruik van een gevarieerde toolset. Het team heeft kennis van XML, XSLT, Bash, JavaScript, PHP, Perl, Ruby, Java en C.. . . . . Wij vragen. . . . . . . Afgeronde HBO/WO ICT opleiding. . . Minimaal 1 jaar ervaring met applicatieontwikkeling als junior en minimaal 4 jaar ervaring met applicatieontwikkeling als medior.. . . Wil graag werken met Agile methodieken. . . Een DevOps mindset. . . Flexibel in het aanleren en gebruiken van technieken (zowel open source als commercieel).  . Ben je niet bang om buiten de gebaande paden te denken. Houd je van nieuwe dingen proberen. Ben je een gedreven en resultaatgerichte teamspeler met een gezonde dosis aan verantwoordelijkheidsgevoel. Bouw je graag mee aan onze missie: ‘to explore the potential of nature to improve the quality of life’ vanuit een levendige Campus? Dan ben jij onze kandidaat!. . . . . Wij zijn. . . . . Wageningen University &amp; Research is in 2017 door de Keuzegids Universiteiten voor de 13de keer op rij verkozen tot beste universiteit van Nederland en behoort tot de top 150 wereldwijd. Zo’n 6.500 medewerkers en 12.000 studenten uit ruim 100 landen werken in ons domein van gezonde voeding en leefomgeving, zowel voor overheden als voor het bedrijfsleven.. De ruim 160 medewerkers van de afdeling FB-IT richten zich op het leveren van de IT-dienstverlening aan Wageningen University &amp; Research. FB-IT staat aan de vooravond van een transformatietraject van waaruit het verder wil doorgroeien naar een flexibele, wendbare organisatie die met snellere introductie en doorontwikkeling van haar diensten beter aansluit bij haar klant(en). . . . . . Wij bieden. . . . . Een aanstelling van 1 FTE (36 uur) per week, voor in eerste instantie 1 jaar, met een marktconform salaris tot max €3818,- bruto per maand (schaal 9) als junior of een salaris tot max €4253,- bruto per maand (schaal 10) als medior bij een volledige dienstbetrekking (36 uur). De functie is ingedeeld in de Hay systematiek als Ontwikkelaar 3-4 inschaling afhankelijk van kennis/competenties/ ervaring. Daarnaast bieden wij uitstekende secundaire arbeidsvoorwaarden waaronder keuze voor een goede balans tussen werk en privé, goede ontwikkelingsmogelijkheden, en een flexibele (deeltijd) invulling van de arbeidstijd.. . . . . Enthousiast of nieuwsgierig geworden?. . . . . Voor meer informatie over de functie kun je contact opnemen met Sander van den Steen van Ommeren, team coördinator, . sander.vandensteenvanommeren@wur.nl.  Voor meer informatie over de procedure kun je contact opnemen met Marjon Hendriks (Senior HR Adviseur), . marjon1.hendriks@wur.nl. . . . . Solliciteren op deze vacature kan uitsluitend online tot maandag 4 juni 2018 via  . deze link. .. . . . Acquisitie naar aanleiding van deze vacature wordt niet op prijs gesteld.. . . . . Trefwoorden: Vacature, fulltime, Wageningen, DevOps Engineer, software developer, software architect, IT, ICT, Agile.. . "
  },
  "287b3c52-4a80-11e8-95d7-60a5a19c6c42": {
    "title": "sr. rails & front end developer ",
    "description": ". Are you an Engineer looking to revolutionize the way people innovate and build software? Do you want to create something that will change the way people think about innovation, and work with cutting-edge visualization, collaboration, and social ideation technologies at the same time? We are looking for highly ambitious engineers who want to work on major aspects of the Aha! product — from the back-end through to the end user experience. If this is you, we want to hear from you!. . . . As a Senior Rails Engineer at Aha!, you will have an excellent opportunity to join a breakthrough and profitable company that is growing fast. Aha! was founded by a proven team of Silicon Valley veterans whose last two businesses were acquired by well-known public companies. More than 150,000 users trust Aha! to link their brilliant strategy to their team's work and create visual roadmaps.. . . . We are looking for someone who:. . . . . .   Is experienced in Ruby-on-Rails. . .   Has worked on key functionality for a cloud-based product. . .   Has a computer science degree or demonstrated experience solving challenging CS problems. . .   Wants to work on a major aspect of product functionality from back-end algorithms through to the user interface. . .   Wants to be great and work in a fast-moving, online environment where the end-user is key. . . . We are committed to being great, and we want someone who:. . . . . .   Can work at a fast-paced company where the feedback cycle is measured in hours rather than weeks. . .   Has a \"get it done\" attitude and a background of delivering superb work again and again. . .   Is seeking a career-defining opportunity and a proven, results-oriented team that has sold multiple software companies. . . . . We are building a distributed team, and you can work from anywhere in North America for this role. We offer generous salary, equity, benefits, and a profit-sharing program.. . . . . . For immediate consideration, please follow these  . helpful guidelines.   and contact us at  . Engineering-jobs@aha.io. . Be sure to include a link to your GitHub or code portfolio. If you have the right background, we will quickly follow up with you. We are not working with recruiters or third-party agencies.. . "
  },
  "2782ebb6-4a75-11e8-9ebb-47d33cbed1ee": {
    "title": "Senior Software Engineer",
    "description": ". ChromoLogic is actively engaged in multiple cutting edge applied research and development programs. The ideal candidate will have a strong interest in developing software for telehealth, medical diagnostics, and industrial applications. We bring a unique, multi-disciplinary approach to compelling scientific challenges and our core capabilities stem from the diverse talents of our team. We provide a highly creative, collaborative and challenging work environment where each individual can not only attain their full potential, but also grow and learn new skills. . . . . Job Duties . . . . . . Contribute toward the company’s ongoing programs in Biomedical and Industrial Solutions business. . . Develop, test and maintain a wide range of software applications. . . Design and document software interfaces and architecture. . . Work with product management to deliver delightful user experiences to our customers. . . Work closely with QA to ensure high-quality software releases. . . Manage through uncertainty in an innovative, multidisciplinary team environment . . . Understand how to prioritize tasks based on a product roadmap and drive execution. . . Help lead software development processes. . . . Multiple positions open. . . . Skills Requirements . . . . . . BS degree in Computer Science, Computer Engineering, or equivalent. . . 3-5+ years of industrial experience developing software products. . . Proficiency in Python and C/C++. . . Exposure to SQL and/or NoSQL. . . Comfortable using Git. . . Experience writing unit and integration tests. . . JavaScript experience is a plus. . . Image processing or computer vision experience preferred. . . Interest in user interface design and development. . . Well versed in software development and documentation best practices. . . Good technical communication skills, written and verbal. . . US Citizen or US Permanent Resident due to government contract requirements. . . "
  },
  "d37afd36-4a67-11e8-9114-574d811607c3": {
    "title": "Senior Software Engineer",
    "description": ". . Nylas.  is a product built for engineers, by engineers. We make it easy to add email, contacts, and calendars to any app. By being at the core of business communication, we believe we can shape the future of how people work.. . . . We’re looking for a Senior Software Engineer to help us scale and build new products on top of our APIs. Right now, our open-source Python sync engine regularly archives terabytes of data across a massive SQL cluster, and our Flask APIs handle tens of millions of requests a day. . . . . We make a big effort to create an inclusive environment that is open, frank, and empowering. If you’re excited to architect complex systems with a small, rapidly-growing team, come join us!. . . . About Nylas. . . . Nylas makes it easy to add email, contacts, and calendars to any app. We have spent the last four years developing an API that is clean, performant, secure, and saves our customers an average of 18 months of development time. Since a user’s inbox has more data than your typical startup, we’ve had to solve some pretty challenging big data, high speed, and availability requirements.. . . . Nylas has raised over $8M from 8VC, Data Collective, Fuel Capital, SV Angel and more. Our team is based in San Francisco and members have previously worked at Dropbox, Google, Facebook, Microsoft, Oracle, SAP, and VMware. . . . . Our team collaboratively wrote about our values, benefits, perks, and published them in our open-source handbook. Learn more them here: . https://www.keyvalues.com/nylas. .. . . . About This Job. . . . In this job you will:. . . . . . Own and ship new features from inception to deployment in a highly-collaborative environment. . . Mentor fellow engineers and help set engineering norms and best practices. . . Work on projects like sharding and scaling existing systems, implementing new Exchange protocols, or architecting mail data processing pipelines. . . Work to improve the day to day workflow, developer experience, and velocity of your team. . . Be an investigator for tricky, critical customer issues. . . If you’re up for it, you can even talk at conferences, write blog posts, and make strong showings at local events!. . . . What makes you a great fit for this role:. . . . . . You love working collaboratively with your fellow engineers on a daily basis. . . You’re pragmatic as an engineer and empathize deeply with the customers using your product. . . You have experience architecting or helping build a product’s architecture at scale, including large infrastructural and data challenges - especially across multiple servers. . . You love finding ways to make your whole team’s life better and would love to have a hand in shaping your team’s growth and culture. . . You love using Python OR are excited by the prospect of using Python on a daily basis. You’re also excited about using different parts of our tech stack:. . . . . Backend: Python with MyPy, Flask, SQL, Redis, AWS, nginx, ElasticSearch, Linux. . . Frontend: Flow-typed Javascript, React/Redux. . . DevOps: Ansible, AWS. . . . . . . . Benefits:. . . . . . Salary is between $140,000 and $160,000. . . We have offices in both San Francisco and New York City with an occasional work-from-home policy. . . We offer full medical/vision/dental insurance, including families. . . Generous vacation (including mandatory 10-consecutive-biz-day vacation every year). . . 401k plan. . . Commuter benefits in SF + $100 monthly Lyft credit. . . Lunch provided every day!. . . Gym membership reimbursement up to $70/month . . . Book clubs (books purchased for these are free). . . Massages every other Wednesday (by appt). . . $1000 annual allowance for continuing education like classes and conferences. . . "
  },
  "cd806b64-4a21-11e8-9e08-652c5e9ffe1f": {
    "title": "Java Systems Engineer",
    "description": ". YinzCam is the industry-leading mobile developer for sports team apps in the United States, with clients in most major professional sports leagues including the NFL, NBA, NHL, MLS, and even international clients such as the Australian National Rugby League. We are experiencing a period of significant growth in our business, and are looking to add more full-time employees to build upon critical applications used by our clients and users, and to enhance the systems our mobile apps depend upon.. . . . You will have the opportunity to work in a team of highly-skilled and experienced developers to build and deploy the tools that support professional sports teams’ official mobile apps, and that will improve the experience of millions of fans around the world. You will work closely with designers and back-end developers in a collaborative environment to develop compelling applications and client-facing interfaces. You will also have the opportunity to innovate and explore cutting edge technologies and frameworks.  . . . . WHY ARE WE HIRING? We are currently expanding rapidly to take on even more clients – more teams, stadiums, and sports, including overseas – and we are looking to grow our mobile team by adding full-time developers to meet the demand for our products, and to bring even more innovations and features to our existing offerings. Our company affords a close-knit entrepreneurial environment with every individual being exposed to, and having a tangible impact on, the company’s business.  . . . . Desired Skills and Experience Required: . . . . . .  At least 2 years of experience in programming with Java SE . . .  Experience with Java 7 language features, familiarity with Java 8 . . .  Experience with network programming and web services (Jersey or JAX-RS is desirable) - - . . .  Experience with dependency injection techniques desired (e.g., Google Guice) . . .  Experience with XML and JSON serialization (JAXB is desirable) . . .  Experience with database interfaces (jOOQ is desirable) . . .  Familiarity with common third-party Java utility libraries (Apache Commons, Google Guava, Joda Time) . . .  Experience using Maven for build management and automation (Gradle experience also acceptable) -  Experience with Git for version control . . . . Highly desirable: . . . . . .  Experience with C# and ASP.NET MVC - . . .  Experience with one or more scripting languages (Python and Bash preferred) . . .  Experience interfacing with mobile and/or web developers and designing client-server interfaces . . .  Experience with Linux programming and system administration . . .  Experience with MySQL database administration . . .  Experience with Amazon Web Services or Microsoft Azure . . .  Experience with common web servers such as IIS and Nginx . . .  Have at least one back-end project that you developed (or contributed substantially to) . . . . Please send your resume and highlight: . . . . . .  Your overall technical skills and background . . .  Your relevant professional and academic experience . . .  Your Java development skills (mention example projects, number of months of experience) . . .  Your back-end development skills (mention example projects, number of months of experience) . . .  Your system-integration skills, e.g., working with software libraries, APIs . . .  Your software-engineering skills, e.g., version control (mention how many others on the team, and what your role was on the project). . . . . . To all recruitment agencies: YinzCam does not accept agency resumes. Please do not forward resumes to our jobs alias.  YinzCam is not responsible for any fees related to unsolicited resumes.. "
  },
  "f9de27fc-49f2-11e8-8e67-bca1a68363e5": {
    "title": "Site Reliability Engineer",
    "description": ". . . imgix is looking for an experienced Site Reliability Engineer to join our Infrastructure Engineering team. In this role, you will work closely with other members of the Infrastructure team to build and operate the high performance, high availability infrastructure that powers image delivery for some of the largest sites on the Internet.. . The imgix Infrastructure team is responsible not just for building and operating the core imgix service, but also for encouraging operational best practices in the larger engineering organization. We seek experienced engineers who not only have strong professional skill sets but who are also passionate about making positive contributions to the evolution of their team members and the company as a whole.. . . Core Team Responsibilities. . . . . Build and operate highly reliable and performant systems at scale..     . Observe and measure the imgix infrastructure for performance, reliability and correctness..     . Contribute expertise towards architectural planning and ensure that the company builds services that meet our objectives, are operationally maintainable, and leverage the right tools and frameworks..  . Foster and promote operational awareness within the engineering team..   . Actively participate in the review and testing process for our production services.. . . . . You Are. . . . . Pragmatic about your engineering choices; able to change course when new information becomes available; focused on problem solving..   . A believer in automation as a tool that helps to reduce operational incidents and improves reliability..    . Collaborative in a team environment when designing and implementing systems; excited to transfer knowledge and expertise to others..    . Passionate about improving service quality.. . . . . Things You've Done Before. . . . . Participated in on-call rotations for a large scale production infrastructure..  . Automated a zero-downtime deployment in a high traffic environment..    . Worked in an environment that utilized Content Delivery Networks..   . Utilized configuration management tools (such as Chef, Ansible or Puppet)..  . Administered Linux production systems, with some familiarity around software packaging and system tuning..   . Monitored and collected data from production systems (using tools like Grafana, Prometheus, Nagios, Logstash).. . . . . About Us. . . imgix is building the future of visual media on the Internet. The imgix service is the premier solution to deliver impactful, engaging, highly responsive and super fast imagery to eyeballs around the world. It consists of a top tier image delivery platform tightly coupled with imgix's proprietary, on-demand image processing pipeline. It also provides customers with great design flexibility while reducing the engineering investment required to serve state-of-the-art visual media. imgix enables our customers to greatly increase the value of their imagery and get back to building awesome things.. . We are located in downtown San Francisco, pretty close to BART, Caltrain and a really good sandwich place. Employee benefits are comprehensive (401k, medical, dental and vision), perks are generous (catered lunches, paid rides home, the occasional team outing), vacation time is flexible and salaries are commensurate with experience. We also provide employees with the tools they need to be effective in their work: fancy keyboards, standing desks, a desk cactus and maybe even a laptop.. . . If you would like to help us build the future of image serving on the Internet, submit your resume/CV for consideration. Principals only please. We look forward to hearing from you!.  . "
  },
  "0c378362-49b2-11e8-89d0-6340ff903843": {
    "title": "Software Engineer",
    "description": ". HashiCorp builds DevOps tools for modern applications. We build open source tools, and enterprise products on top of them. The HashiCorp suite empowers organizations to provision hybrid cloud infrastructure, secure secrets across distributed applications, and run dynamic resources.. . . . We value top-notch collaboration and communication skills, both among internal teams and in how we interact with our users. We take care to balance and be responsive to the needs of our open source community as well as our enterprise level customers.. . . . HashiCorp Engineering is largely a remote team. While prior experience working remotely isn't required, we are looking for team members who perform well given a high level of independence and autonomy.. . . . HashiCorp’s Packer is an open source project that automates the building of machine images across cloud provider and virtualization tools. It is used for business critical operations around the world, at start-ups and Fortune 500 companies. You will need to navigate the complexity of a broad portfolio of users and use cases, while at the same time keeping the project focused by adhering to the Tao of HashiCorp.. . . . We want you to contribute to development and maintenance of Packer in tight collaboration with the growing Packer community, utilizing operations and engineering skills to work across a diverse set of infrastructure providers.. . . . In this role, you can expect to:. . . . . . Support integrations with new and existing infrastructure providers.. . . Help support open source contributors, new and seasoned, with supportive and constructive code review, documentation improvements, and workflow changes.. . . Work on Packer issues and improvements critical to the success of HashiCorp customers and the broader community.. . . . You may be a good fit for our team if:. . . . . . You're comfortable and enjoy writing Go.. . . You have experience with customer support or OSS community support to help work with the Packer community.. . . You understand the challenges of operating and maintaining production systems in cloud environment.. . . You are familiar with infrastructure management concepts and ecosystem.. . . You understand Packer and care about its users' experience.. . . . In your cover letter, please describe why you're interested in working at HashiCorp, and on the Packer team in particular.. . . . . At HashiCorp, we are committed to hiring and cultivating a diverse team. We're always looking to fill multiple roles: if you are on the fence about whether you would be successful working with us, please apply anyway!. . "
  },
  "ad6e9774-4977-11e8-808a-edb2ba4acd39": {
    "title": "Senior UI Software Engineer, Core Technology Group",
    "description": ". . Job Number:.  23303. . . . At Informatica, We “DATA”. We Do Good, Act As One Team, Think Customer First, and Aspire For The Future. Informatica enables companies to unleash the power of data to become more agile, realize new growth opportunities, lead to new inventions resulting in intelligent market disruptions.. . . . A career with Informatica gives you all the opportunities and benefits that can only come from working for the trusted industry leader, including amazing, energetic team members; a globally diverse workplace; and a company dedicated to your success, growth and advancement.. . . . . Our Team. . . . . The Core Technology Group (CTG) is the innovation hub within Informatica that delivers an extensible and scalable platform that is the foundation for all other Informatica products. Specifically, our team focuses on a high performance Data Engine that can scale on Hadoop, Spark, Cloud and multi-processor environments. The engine can handle batch, request/response and real-time streaming workloads to deliver data for applications. Thousands of customers rely on our service for moving billions of records every day.. . . . . Your Opportunity. . . . . The Data Engine has been a key constituent of Informatica’s platform and serves multiple products such as Data Services, Data Quality and Profiling. Informatica products rely on the Data Engine to fulfill the vision of a Virtual Data Machine which can execute data integration jobs either natively or across execution environments such as relational databases, Hadoop or cloud.. . . . You will be a key contributor to fulfilling this vision by providing our customers with UI-driven tooling for developing data pipelines to seamlessly run data transformation without specialized coding. This data could be enterprise and partner data from hosted Cloud services and on-premise deployments or arbitrary data from social web sites and media.. . . . . Our Ideal Candidate. . . . . You are an experienced UI software engineer who has worked on developing large UI systems. You relish the opportunity to work at the intersection of Big Data and usability to deliver data processing capability across different use cases that include batch, request/response and real-time systems.. . . . You enjoy technical challenges, assuming new responsibilities and leveraging your strong communication skills.. . . . . Your Responsibilities. . . . . The successful candidate will be based in Redwood City, CA and will be responsible for:. . . . . .   Working with technical leaders and stakeholders to understand requirements and design user interface mockups and diagrams to help visualize changes in functionality. . .   Ensuring product adoption by using your design and usability skills to influence technical product decisions. . .   Facilitating the collaboration and engagement between senior members of the team to ensure sound design and implementation of big functional areas for the Data Engine. . .   Working closely with architects, development and QA engineers to discuss and evangelize features. . .   Collaborating with geographically dispersed, cross-functional teams in an Agile environment. . .   Mentoring junior engineers on technical, architectural, design and related issues. . . . Representative accountabilities may include, but are not limited to:. . . . . .   Designing, implementing, documenting, analyzing and operationalizing platform features clearly to ensure that others may readily utilize them. . .   Interacting with QA and documentation teams to clearly communicate the features and behaviors of the system. . .   Reviewing functional and test specifications and conducting training sessions for global services and support teams. . .   Assisting customers and field engineers with troubleshooting issues and problems. . . . . Your Qualifications. . . . . . .   4 or more years of relevant professional experience, a portion of which was within an enterprise software company. . .   Solid experience developing UI products. . .   Good understanding of UI development patterns such as MVC, Observer/Observable. . .   Strong programming skills in Java. . .   Demonstrated understanding of object oriented design and programming. . .   Knowledge of Hadoop, Hive, and Spark is highly desired. . .   Knowledge of Cloud ecosystems (AWS, Azure, etc) is a great plus. . .   Experience with Eclipse RCP, OSGI is a great plus. . .   Proven ability to work well with others in a fast paced, iterative product definition and development environment. . .   Able to work independently with little direct supervision and take initiative; willing to mentor and develop others. . .   Working knowledge of Software Development Lifecycle, QA methodology, testing techniques and approaches. . .   Experience in the following: test automation, build infrastructure, release tooling, framework development. . .   Development of highly available public Web APIs. . .   Experience debugging in Windows, Linux, MAC and/or Android. . .   Able to drive innovation and discussions to create and improve product, process and technology.. . .   Promote and apply engineering best-practices including code reviews, design/architecture reviews, unit testing code coverage review. . .   Utilize analytical skills in determining the root cause of problems, and demonstrate ability to multi-task and re-prioritize responsibilities based on changing requirements.. . .   A passion and curiosity for creating and building things. . .   BS in Computer Science or a related technical discipline; advanced degree preferred. . . . All qualified applicants will receive consideration for employment without regard to race, sex, color, religion, sexual orientation, gender identity, national origin, protected veteran status, or on the basis of disability.. "
  },
  "a9e2d160-4977-11e8-8e7c-9d7c584925f8": {
    "title": "Principal User Experience Designer",
    "description": ". . Job Number:.  23292. . . . At Informatica, We “DATA”. We Do Good, Act As One Team, Think Customer First, and Aspire For The Future. Informatica enables companies to unleash the power of data to become more agile, realize new growth opportunities, lead to new inventions resulting in intelligent market disruptions.. . . . A career with Informatica gives you all the opportunities and benefits that can only come from working for the trusted industry leader, including amazing, energetic team members; a globally diverse workplace; and a company dedicated to your success, growth and advancement.. . . . . Principal User Experience (UX) Designer – Informatica Enterprise Data Lake (EDL). . . . . Our Team. . . . The Informatica User Experience (UX) team is the driving force behind the design and usability of a broad spectrum of data integration and data management products. We are a globally diverse, world-class team of designers and researchers who drive the product user experiences and innovation initiatives company-wide. We are a creative, collaborative, and fun team and believe in recruiting the best. We care deeply about each team members work-life balance, and are committed to growing careers.. . . . Your Opportunity. . . . Achieving success in next-generation analytics has been constrained by the difficulty of accessing data in silos, and the traditional approach of gathering requirements, and then designing and building valuable data assets. In the age of data democratization, business analysts and data scientists are looking for self-service methods to discover relevant data and prepare it for actionable insights. To help customers with these challenges, Informatica is creating self-service data-discovery and preparation capabilities for data analysts in big data and the cloud. We are seeking a Principal User Experience Designer who can take the lead on delivering simple, understandable, yet powerful solutions addressing these new challenges.. . . . Our Ideal Candidate. . . . You are highly experienced in user-centered UX design for enterprise applications. You excel in designing rich, scalable, and high-productivity web-based, cloud services. You thrive in a collaborative environment working with other UX designers, researchers and product team members to deliver best practices in user-centered design, information architecture, and interaction design. You enjoy working with product managers to understand and define business requirements, but you are also well-versed in discussing technical capabilities and constraints with software developers. Most importantly you relish interacting with customers, testing your design ideas and assumptions, and validating your designs to help the company manage risks and costs.. . . . Your Responsibilities. . . . The successful candidate will be based at our Redwood City, CA campus and will be responsible for:. . . . . .   Planning and designing our Enterprise Data Lake product. . .   Delivering UX designs while working closely with cross-functional teams (Product Managers, User Researchers, UX Designers, and Developers) to create innovative user experiences for new and extended product offerings.. . .   Helping to plan and conduct stakeholder interviews and design workshops. . .   Synthesizing results from user research into coherent designs. . .   Creating information architectures, task flows, user interaction models, wireframe screen flows, prototypes, detailed designs, design briefs, design specifications and guidelines with little direction. . .   Influencing product teams and the organization to achieve solutions that are right for our customers. . .   Fostering a fun, creative, collaborative spirit. . . . Your Qualifications. . . . . .   8+ years of experience designing user interfaces and user experiences for web-based software. . .   Masters’ degree or equivalent in related discipline (HCI, Industrial Design, Cognitive Psychology, Graphic Design, etc.). . .   A portfolio that demonstrates your design talent, including conceptual models, navigation and user flows, information design, and high-fidelity mock-ups. . .   Strong knowledge and understanding of “design-led” product development. . .   Proven ability to generate end-to-end designs - from concept through production detailing. . .   Demonstrated experience developing and communicating UX design guidelines and design specifications. . .   Proven effectiveness working in cross-functional teams that include product management, engineering, marketing, and other UX professionals. . .   Demonstrated proficiency with wireframing/prototyping tools, such as Sketch, Illustrator, Axure, Photoshop, Balsamiq, Visio, etc.. . .   Experience using user-research methods, analytics, and other insights to guide product direction. . .   Excellent written and verbal skills. . . . . ### Nice to Have. . . . . . . Previous experience designing products that allow users to view, prepare, and analyze data sets.. . . . All qualified applicants will receive consideration for employment without regard to race, sex, color, religion, sexual orientation, gender identity, national origin, protected veteran status, or on the basis of disability.. "
  },
  "a6797222-4977-11e8-88ae-c942baa6c401": {
    "title": "Senior DevOps Engineer",
    "description": ". . Job Number.  23274. . . . At Informatica, We “DATA”. We Do Good, Act As One Team, Think Customer First, and Aspire For The Future. Informatica enables companies to unleash the power of data to become more agile, realize new growth opportunities, lead to new inventions resulting in intelligent market disruptions.. . . . A career with Informatica gives you all the opportunities and benefits that can only come from working for the trusted industry leader, including amazing, energetic team members; a globally diverse workplace; and a company dedicated to your success, growth and advancement.. . . . . Our Company. . . . . Everything Informatica does begins and ends with data. Simply stated, we make great data – data that is connected, clean and safe -- ready to use so that all enterprises can be data ready and put their unique information potential to work. A data ready enterprise is decision-ready, customer-ready, application-ready, cloud-ready and regulation-ready. And by design, our Intelligent Data Platform delivers great data to enable our customers to be ready for anything.. . . . . Our Team. . . . . DevOps is a key function within Informatica as we grow our business and focus on cloud based solutions. Delivering quality solutions to our customers is our top priority. As part of our DevOps team, you will work with geographically diverse experts as we scale our infrastructure to support hosted environments for our customers.. . . . . Your Opportunity. . . . . You will join a growing team and will be responsible for DevOps and Operations for several Informatica products. Our environment uses Agile methodologies and works closely with the Research and Development teams to ensure high-quality, stable environments for our customers.. . . . . Your key responsibilities:. . . . . . .   Ensure security, performance and high availability of all environments by applying Infrastructure as Code principles.. . .   Enabling deployment to cloud and on premise environments.. . .   Create automated Infrastructure administration workflow capabilities by removing bottlenecks and inefficiencies.. . .   Continuously look for opportunities to improve upon the development and build capabilities in the team.. . .   Share your experience and knowledge with other members of the DevOps team.. . . . . Your Qualifications. . . . . . .   Experience in Linux Administration and Cloud environments.. . .   Experience with LAMP stack applications.. . .   Linux administration experience e.g. RedHat &amp; CentOS.. . .   Good scripting skills in bash and at least one of Go/Python/PHP/Javascript.. . .   Experience with Virtualization and Cloud e.g. VMware and AWS.. . .   Exposure to Docker and containers.. . .   Exposure to Java environments and microservices.. . .   Familiar with Agile development lifecycle and practices- TDD, CI/CD.. . .   TCP/IP and network administration, VPN, Firewalls.. . .   AWS resource management with CloudFormation and/or Terraform.. . .   Continuous integration with Puppet (preferred) or Chef.. . .   Jenkins, Gradle or other OSS CI tools.. . .   Knowledge of RDBMS e.g. Postgres. MySQL; Familiarity with NoSQL Databases e.g. MongoDB a plus. . .   Any experience with administering Solr or ElasticSearch and RabbitMQ or similar would also be welcome.. . .   Experience with Spinnaker is preferable.. . .   Excellent command of the English language.. . . . Informatica offers a competitive compensation package that includes base salary, flexible time off, performance bonus and more. It’s an exciting time to work at Informatica, you can learn more about our company, and our products and services at . www.informatica.com.  We are an Equal Opportunity Employer (EOE).. . . . . #LI-PH1. . . . . All qualified applicants will receive consideration for employment without regard to race, sex, color, religion, sexual orientation, gender identity, national origin, protected veteran status, or on the basis of disability.. "
  },
  "a322bd0e-4977-11e8-82a2-f8413ac78eba": {
    "title": "Senior Software Engineer, Senior Software Engineer, Informatica Cloud Service",
    "description": ". . Job Number:.  23194. . . . At Informatica, We “DATA”. We Do Good, Act As One Team, Think Customer First, and Aspire For The Future. Informatica enables companies to unleash the power of data to become more agile, realize new growth opportunities, lead to new inventions resulting in intelligent market disruptions.. . . . A career with Informatica gives you all the opportunities and benefits that can only come from working for the trusted industry leader, including amazing, energetic team members; a globally diverse workplace; and a company dedicated to your success, growth and advancement.. . . . . Senior Software Engineer,  Informatica Cloud Service. . . . . . Our Company. . . . . Informatica Corporation is the world’s number one independent provider of data integration software. Thousands of enterprises worldwide depend on Informatica data integration, data quality, and big data solutions to access, integrate, and trust their information assets residing on premise and in the Cloud.. . . . . Our Team. . . . . The Informatica Cloud team is responsible for building the leading integration-Platform-as-a-Service (iPaaS) product to provide Data Integration, Data Quality, Information Lifecycle Management, Test Data Management, Master Management and other Information Management solution as a service on the cloud. Thousands of customers rely on our service for moving billions of records every day.. . . . . Your Opportunity. . . . . As a senior software engineer of the Informatica Cloud team, you will work with a world class engineers to design and build the next generation microservices based cloud platform using the latest cutting-edge cloud technology, such as Amazon AWS, Saleforce.com, Microsoft Azure and Docker, to provide non-disruptive cloud data integration service to our customers. . . . . Our Ideal Candidate. . . . . You are an experienced full stack software engineer with system expertise. You are motivated to combine the art of design with the art of programming. You have experience on designing and developing services for modern large-scale data warehouse and data lake. You have experience in developing Data Integration (DI) tools. You have strong knowledge on Web UI technology, such as JQuery, Ajax, HTML5/CSS. You have experience in java server development and technologies such as Spring and Hibernate. You enjoy working on technically challenging projects. You are willing to work on many different projects, and interested in assuming various responsibilities. You are comfortable working in a fast-pace, agile development environment, self-motivated with strong inter-personal and communication skill.. . . . . Your Responsibilities. . . . . The successful candidate will be based in Redwood City, CA and will:. . . . . .   Part of an experienced, energetic team on a rapid, agile development schedule. . .   Participates in the development, specification and the design of the product.. . .   Feature development and follow through with other team members to ensure high quality and predictable delivery. . .   Write unit, integration and automated tests for the developed features. . .   Provide detailed estimates of projects and meet project schedules. . .   Work with QA team to ensure minimal regressions and comprehensive customer-centric testing. . .   Give iteration demos to show progress against requirements. . .   Review QA test specifications and feature documents. . .   Participate in internal/cross team meetings, scoping, decision making and technical documentation. . .   Mentor junior engineers on technical, architectural, design and related issues. . .   Assisting customers and field engineers with troubleshooting issues and problems. . . . . Your Qualifications. . . . . . .   3+ years of Java/J2EE enterprise software development experience, preferably with data-intensive and multi-threaded service-oriented cloud products with high performance and scalability requirements. . .   Experience in web client technologies, including but not limited to HTML5, CSS, Angular JS, Bootstrap, JQuery, JavaScript, Strut. . .   Hands-on experience of J2EE Spring Framework, Persistence Framework, OSGi, Java SDK, web service protocol stack, REST, XML, JSON preferred, XPath. . .   Knowledge of software implementation best practices. . .   Experience with cloud application development, deployment, operation, and support preferred. . .   Solid knowledge of relational database system fundamentals desired. . .   Knowledge of latest Container technology, such as Docker, preferred.. . .   Experience in Agile development methodologies and release management techniques. . .   Able to work independently with little direct supervision and take initiative; willing to mentor and develop others. . .   Proven ability to work well with others in a fast paced, iterative product definition and development environment. . .   Strong analytical and troubleshooting skills. . .   BS in Computer Science or a related technical discipline; advanced degree preferred. . . . Informatica offers a competitive compensation package that includes base salary, medical, retirement and employee stock purchase (ESP) programs, flexible time off and more. Our generous benefits vary depending on your geographic work location. It’s an exciting time to work at Informatica. You can learn more about our company, our products and our services at . www.informatica.com. . We are an Equal Opportunity Employer (EOE).. . . . All qualified applicants will receive consideration for employment without regard to race, sex, color, religion, sexual orientation, gender identity, national origin, protected veteran status, or on the basis of disability.. "
  },
  "9f891a9e-4977-11e8-9f66-9072f030ce32": {
    "title": "Principal Front End Engineer, Informatica Cloud Service",
    "description": ". . Job Number:.  23156. . . . At Informatica, We “DATA”. We Do Good, Act As One Team, Think Customer First, and Aspire For The Future. Informatica enables companies to unleash the power of data to become more agile, realize new growth opportunities, lead to new inventions resulting in intelligent market disruptions.. . . . A career with Informatica gives you all the opportunities and benefits that can only come from working for the trusted industry leader, including amazing, energetic team members; a globally diverse workplace; and a company dedicated to your success, growth and advancement.. . . . . Principal Front End  Engineer, Informatica Cloud Service. . . . . . Our Company. . . . . Informatica Corporation is the world’s number one independent provider of data integration software. Thousands of enterprises worldwide depend on Informatica data integration, data quality, and big data solutions to access, integrate, and trust their information assets residing on premise and in the Cloud.. . . . . Our Team. . . . . The Informatica Cloud team is responsible for building the leading integration-Platform-as-a-Service (iPaaS) product to provide Data Integration, Data Quality, Information Lifecycle Management, Test Data Management, Master Management and other Information Management solution as a service on the cloud. Thousands of customers rely on our service for moving billions of records every day.. . . . . Your Opportunity. . . . . As a software engineer of the Informatica Cloud team, you will work with a world class engineers to design and build the next generation cloud platform.. . . . . Our Ideal Candidate. . . . . You are a professional software engineer with full-stack web application development experience. You have skills to create well-designed web interfaces resulting in rich, intuitive user experiences, and deliver high-quality, modular code for complex web UI components and pages.. . . . You enjoy working on technically challenging projects. You are willing to work on many different projects, and interested in assuming various responsibilities. You are comfortable working in a fast-pace development environment, self-motivated with strong inter-personal and communication skill.. . . . . Your Responsibilities. . . . . The successful candidate will be based in Redwood City, CA and will:. . . . . .   Leading and driving the delivery and architecture for large functional areas. . .   Investigate, design, and develop the features individually or with a small team. . .   Building interactive, responsive and scalable easy-to-use user interfaces. . .   Participate in feature development and follow through with other team members to ensure high quality and predictable delivery. . .   Work with QA team to ensure minimal regressions and comprehensive customer-centric testing. . .   Participate in internal/cross team meetings, scoping, decision making and technical documentation. . .   Assisting customers and field engineers with troubleshooting issues and problems. . . . . Your Qualifications. . . . . . .   8+ years of enterprise software development experience, preferably with data-intensive and multi-threaded service-oriented cloud products with high performance and scalability requirements. . .   5+ years of experience in web client technologies such as HTML, CSS, Javascript and AJAX.. . .   5+ years of experience of JavaScript frameworks and libraries, such as JQuery, Angular, Dojo or Backbone. . .   Hands-on experience of J2EE Spring Framework, Persistence Framework, Java SDK, REST, XML, JSON. . .   Experience of big data process platform, such as Hadoop or Spark, is a plus. . .   Strong Object Oriented Programming Skills. Good understanding of data structures and algorithms.. . .   Experience with cloud application development, deployment, operation, and support. . .   Experience in Agile development methodologies and release management techniques. . .   Ability to work independently with little direct supervision. . .   Strong analytical and troubleshooting skills. . .   BS in Computer Science or a related technical discipline; advanced degree preferred. . . . All qualified applicants will receive consideration for employment without regard to race, sex, color, religion, sexual orientation, gender identity, national origin, protected veteran status, or on the basis of disability.. "
  },
  "9c016b88-4977-11e8-877b-11c4ecdc8f84": {
    "title": "Senior Product Manager, Big Data",
    "description": ". . Job Number:.  23134. . . . At Informatica, We “DATA”. We Do Good, Act As One Team, Think Customer First, and Aspire For The Future. Informatica enables companies to unleash the power of data to become more agile, realize new growth opportunities, lead to new inventions resulting in intelligent market disruptions.. . . . A career with Informatica gives you all the opportunities and benefits that can only come from working for the trusted industry leader, including amazing, energetic team members; a globally diverse workplace; and a company dedicated to your success, growth and advancement.. . . . . Our Team.   . . . . Informatica is the leader in Enterprise Cloud Data Management. Informatica Cloud and Informatica Big Data Management is the growth engine for Informatica in coming years. Our industry leading Big Data Management technologies--along with our partners--have helped fuel incredible growth over the last five years. We are seeking a Senior Product Manager to grow Informatica’s Big Data products.. . . . . Your Opportunity.   . . . . In this newly-created role, you will help shape the direction of Informatica big data management product portfolio that enables us to further our leadership position in a highly competitive and rapidly changing market. You will:  . . . . . . Lead the product management for Big Data on Cloud. . . . . Set the product roadmap, driving customer adoption, collaborating with Hadoop technology partners &amp; cloud ecosystems like AWS, Azure, Google cloud and ensuring successful deployments for Informatica’s Big Data products.. . . . . You will work across multiple disciplines – Hadoop technologies, machine learning, interface design - and collaborate with talented peers to fashion compelling and differentiated products.. . . . . Our Ideal Candidate.   . . . . You have prior product management experience and a deep technical background with Big Data, cloud(AWS/Azure), Serverless technologies and/or data integration. You feel comfortable being hands-on with complex technology, have a keen understanding of how it can bring value to a diverse customer base, and can expand adoption across different channels and partner ecosystems. You are a cross-functional leader who will work collaboratively with architecture and product engineering teams, Informatica’s marketing, sales and services staff, and product marketing to drive sales success and results for the Big Data products. You will also work with product managers in other product lines to ensure their products work seamlessly in the Big Data use cases. You enjoy working with customers, partners, sales people, engineers, and anyone else you need in order to achieve business success. You are awesome at creating compelling Try &amp; Buy software offering, and vibrant user community to drive product awareness, adoption, revenue, reference, and success.. . . . . Your Responsibilities.   . . . . Reporting to the Director of Big Data Product Management and based in Redwood City, CA, you will:. . . . . . Work closely with key customers and partners to understand the use cases for Big Data solutions especially on cloud, gaining a deep understanding of their goals and requirements.. . . . . Clearly communicate the value proposition and differentiation of Informatica’s Big Data offerings to our customers. . . . . Keep up to date with the rapidly evolving technologies in the Big Data space and understand the relevance and impact to Informatica’s products. . . . . Author detailed “whole” product requirements including requirements for big data on cloud. . . . . Serve as the voice of the customer in building product functionality that is fit for purpose. . . . . Collaborate with other product managers to ensure seamless operation between components and technologies. . . . . Engage with partners to manage product offerings across hosted and on-premise ecosystems. . . . . Work closely with R&amp;D to drive product priorities and ensure the right set of functionalities for an enterprise class, industry leading product. . . . . Identify needs and develop materials for rapid and effective field enablement. . . . . Provide content for product collaterals, technical white papers and other material needed to ensure fast and successful adoption of the product by customers. . . . . Perform competitive analysis, market, and industry research. . . . . Contribute to the development of the overall product strategy, product roadmap, and business plan for the solution. . . . . Drive user based community and help in enablement for system integrators, internal field and customers.. . . . . Your Qualifications.   . . . . . . 5 or more years in product management or equivalent roles with activity spanning participation in conducting competitive analysis, writing detailed requirement specifications, gathering and prioritizing customer requirements, defining the product roadmap, and authoring technical white papers. . . . . Experience in enterprise applications, big data and data integration. . . . . Strong experience on cloud technologies like AWS/Azure/google including cloud based big data offering like EMR, HDInsight.. . . . . Experience in bringing on-premise enterprise product to cloud to offer as a serverless manage service.. . . . . Prior experience in driving user based community and customer adoption.. . . . . Prior experience in driving expansion of an enterprise software product across partner ecosystems and channels, including on-premise and cloud ecosystem.. . . . . Demonstrated success working with external partner teams. . . . . Strong project management skills and demonstrated ability to coordinate multiple parties within Informatica and external partners to deliver a product. . . . . Experience in driving the success of both mature, stable products as well as new and innovative product concepts. . . . . Ability to gather and prioritize requirements, develop detailed requirements, review functional specifications, participate in functional reviews. . . . . Working knowledge of products and technologies in the Big Data and Data Integration markets. . . . . Strong technical background with the ability to quickly develop deep product knowledge and communicate the business values to the field and customers. . . . . Excellent communication (written and oral) and presentation skills. . . . . Proven organizational skills; ability to multi-task and work on several assignments concurrently; detail oriented. . . . . Ability to contribute to defining a strategic vision and to articulate it in front of a variety of audiences. . . . . Self-motivated and team-oriented; able to work both autonomously and effectively as part of a geographically dispersed team. . . . . Excellent interpersonal skills, proven track record of building strong relationships and establishing credibility with customers, prospects, analysts, sales, R&amp;D, and the management team. . . . . Bachelor’s degree in Engineering/Computer Science or a related technical discipline. . . . . Willing to travel (approximately 15%) for customer visits and trade shows, as well as visit Informatica offices worldwide. . . . All qualified applicants will receive consideration for employment without regard to race, sex, color, religion, sexual orientation, gender identity, national origin, protected veteran status, or on the basis of disability.. "
  },
  "97786436-4977-11e8-8fe4-cb6755acd02c": {
    "title": "Senior Devops Engineer, Informatica Cloud Operations",
    "description": ". . Job Number:.  23110. . . . At Informatica, We “DATA”. We Do Good, Act As One Team, Think Customer First, and Aspire For The Future. Informatica enables companies to unleash the power of data to become more agile, realize new growth opportunities, lead to new inventions resulting in intelligent market disruptions.. . . . A career with Informatica gives you all the opportunities and benefits that can only come from working for the trusted industry leader, including amazing, energetic team members; a globally diverse workplace; and a company dedicated to your success, growth and advancement.. . . . . Your Opportunity:. . . . . Imagine yourself working for the leading independent software provider focused on delivering transformative innovation for the future of all things data. Organizations around the world rely on Informatica to realize their information potential and drive top business imperatives. As a University Graduate at Informatica, you will be exposed to innovativeculture, challenging work and a fast moving, results oriented environment. As a software development engineer, you will be responsible for creating and certifying code for Informatica’s next generation platform to handle the volume, velocity and variety of structured and unstructured data. It could be enterprise and partner data from hosted cloud services and on-premise deployments or arbitrary data from social web sites and media.. . . . . Our Ideal Candidate:. . . . . You are a self-motivated professional who demonstrates the ability to quickly grasp new technologies and products in addition to solving complex problems. You are bright and intellectually curious; deal with concepts and complexity comfortably; are capable, adaptable and agile. You like the excitement of working in a fast-paced environment. You like being creative and are open to new ideas and ways of doing things. You are able to work independently as well as within a team spanning multiple regions. In addition, you have the following attributes:. . . . . .   Ability to quickly learn new technologies in a dynamic environment. . .   Strong Analytical and problem solving skills. . .   Accurately assess critical factors for success and mitigate risk on deliverables. . .   Proactively share technical knowledge and best practices with team members. . .   Possess excellent written and verbal skills. . .   Articulate ideas and thoughts clearly and easily. . .   Interact well with team leaders, peers, junior staff and other managers at various positions. . . . . Your Responsibilities:. . . . . . .   Write clean maintainable product code; develop and maintain the tests; work with the product management and product delivery teams on defining and validating the requirements; handle scoping, planning, internal and external dependencies for the features that you own. . .   Maintain design specifications based on implementation time changes. . .   Contribute to all aspects of the engineering process, i.e. agile, design reviews, etc.. . .   Handle internal and external dependencies for the features that you own. . .   Collaborate with geographically dispersed, cross-functional teams in an Agile environment. . .   Participate in internal/cross team meetings, scoping, decision making and technical documentation reviews. . . . . Your Qualifications:. . . . . . .   Graduating between December 2016 and June 2017 with a BS/MS in Computer Science or equivalent. . .   Strong programming skills in one or more of the following languages: Java, JavaScript, C, C++, Python. . .   Knowledge in Relational databases concepts. . .   Object Oriented design, data structures and programming. . .   Experience with jQuery or other JavaScript frameworks. . .   Operating Systems, multi-threading and algorithm knowledge is preferred. . . . . Additional Information. . . . . Informatica offers a competitive compensation package that includes base salary, medical, retirement and unlimited flexible time off and more. Our generous benefits vary depending on your geographic work location. It’s an exciting time to work at Informatica. You can learn more about our company, our products and our services at . www.informatica.com. . We are an Equal Opportunity Employer (EOE).. . . . All qualified applicants will receive consideration for employment without regard to race, sex, color, religion, sexual orientation, gender identity, national origin, protected veteran status, or on the basis of disability.. "
  },
  "9466830e-4977-11e8-9583-d87ccdb8d62b": {
    "title": "Principal User Experience Designer",
    "description": ". . Job Number:.  23073. . . . At Informatica, We “DATA”. We Do Good, Act As One Team, Think Customer First, and Aspire For The Future. Informatica enables companies to unleash the power of data to become more agile, realize new growth opportunities, lead to new inventions resulting in intelligent market disruptions.. . . . A career with Informatica gives you all the opportunities and benefits that can only come from working for the trusted industry leader, including amazing, energetic team members; a globally diverse workplace; and a company dedicated to your success, growth and advancement.. . . . Our Team The User Experience (UX) team at Informatica is a diverse, globally-distributed, world-class team of designers and researchers who create and champion product user experiences and innovation initiatives. It is a creative, collaborative, and fun group that cares deeply about each team member’s professional growth and development. . . . . . Your Opportunity. . . . . Data security is one of the hottest fields for UX designers to visualize and help organizations identify, manage, and control their sensitive data. The Data Security Group (DSG) at Informatica is one of the fastest growing business units focused on creating useful and usable data-management, data-security, data-privacy, data-protection, and risk-management software.. . . . In this position, you will work closely with DSG product managers, developers, and UX colleagues to design rich, scalable, elegant, and high-productivity user interfaces and experiences that protect data and make the world a safer place.. . . . Our Ideal Candidate You are a talented, multi-dimensional designer, skilled at applying user-centered design principles and techniques, and experienced at designing enterprise applications. You know how to work effectively with other UX designers, UX researchers, product managers, and developers to collaboratively design usable solutions and validate them with customers and end users. You also like taking on interesting challenges and digging deep into domain knowledge, as you balance business and technology constraints to envision complex usage scenarios, create data visualizations, and quickly design concepts and wireframes to address user needs.. . . . . Your Responsibilities. . . . . . .   Plan and design next-generation data-security products.. . .   Work as part of cross-functional teams (Product Managers, Developers, and User Researchers).. . .   Help plan and conduct customer and end-user research, e.g., with observations and interviews.. . .   Synthesize research findings into coherent ideas that describe the structure of the human-computer systems and product experiences.. . .   Analyze tasks and create information architectures, user-interactions, wireframes, screen flows, prototypes, detailed designs, design briefs, design specs and guidelines with little direction.. . .   Influence product teams to achieve solutions that are right for our customers and end users.. . .   Foster a fun, creative, and collaborative work environment.. . . . . Your Qualifications. . . . . . .   8+ years designing user interfaces, preferably with experience in web-based applications.. . .   Experience designing large-scale products, e.g., in data security, data governance, data management, big-data applications, analytics, etc.. . .   Experience conducting user-centered design projects, from concept to production detailing.. . .   Experience developing and communicating UX design guidelines and design specifications.. . .   Proven effectiveness working in cross-functional teams.. . .   Demonstrated proficiency with prototyping tools, e.g., Fireworks, Illustrator, Axure, Photoshop, Balsamiq, Visio, Sketch, etc.. . .   Familiarity with user research and how it can support design.. . .   Excellent written and verbal skills.. . .   Master’s degree or equivalent in HCI, Interaction / Industrial Design, Engineering Psychology, Cognitive Psychology, Computer Science, or a related discipline. . . . All qualified applicants will receive consideration for employment without regard to race, sex, color, religion, sexual orientation, gender identity, national origin, protected veteran status, or on the basis of disability.. "
  },
  "9086d6d0-4977-11e8-8145-1c846733c22f": {
    "title": "Senior Software Engineer, Metadata Foundation Team",
    "description": ". . Job Number:.  23050. . . . At Informatica, We “DATA”. We Do Good, Act As One Team, Think Customer First, and Aspire For The Future. Informatica enables companies to unleash the power of data to become more agile, realize new growth opportunities, lead to new inventions resulting in intelligent market disruptions.. . . . A career with Informatica gives you all the opportunities and benefits that can only come from working for the trusted industry leader, including amazing, energetic team members; a globally diverse workplace; and a company dedicated to your success, growth and advancement.. . . . . Our Team. . . . . The Metadata Foundation team is on an ambitious mission to discover, analyze and map all data assets and relationships in the Enterprise; providing intelligence that allows customers to unlock the power of data. It enables customers to find, classify, visualize data assets and data flows across systems; understand and address data security risks; govern data quality and data flows in the Enterprise. The team is responsible for providing a unified, scalable and extensible metadata cataloging and visualization platform for our fast-growing Data Catalog, Data Security and Data Governance applications and providing intelligence for our broader Enterprise Cloud Data Management offerings.. . . . . Your Opportunity. . . . . Metadata is foundational to Informatica’s Intelligent Data Platform on which all Informatica products are built. We are looking for a Senior Software Engineer to join a highly talented team and work on technologies involving graph databases, BigData/Hadoop, cloud, search engines and data classification and correlation techniques involving ML and NLP.. . . . In this role, you will be responsible for design, implementation and delivery of key components/ services of our platform. You will work in a fast-paced environment with a keen commitment to customer success and work very closely with architects and product managers.. . . . . Our Ideal Candidate. . . . . You are a self-motivated professional who demonstrates strong programming and problem-solving skills along with the ability to quickly understand the product and grasp new technologies. You have a proven record of developing and delivering enterprise class software. You are able to work independently as well as with distributed teams. You are creative and like the excitement of working in a fast-paced environment.. . . . . Your Responsibilities. . . . . As a key member of the platform team your responsibilities will include. . . . . .   Developing detailed design and functional specifications for components that you’ll own. . .   Delivering clean, well tested and maintainable code. . .   Working closely with other engineers and architects to deliver key features end to end. . .   Working with product and engineering managers on validating requirements, providing estimates and identifying risks. . .   Participating in internal/cross team meetings, scoping, decision making and technical documentation reviews. . .   Collaborating with geographically dispersed, cross-functional teams in an fast paced agile environment. . .   Working closely with Customer Support team and customers on challenging production issues. . . . . Your Qualifications. . . . . . .   Bachelor’s or Master’s in Computer Science or a related discipline. . .   At least 3-5 years relevant experience. . .   Strong object-oriented design and programming skills. . .   Strong problem solving, troubleshooting and analytical skills. . .   Excellent coding skills in Java and familiarity with multi-threaded programming. . .   Working knowledge on databases and database fundamentals is mandatory. . .   Familiarity with Linux OS and basic scripting knowledge is mandatory. . .   Experience with ML techniques is a plus. . .   Working knowledge on Graph databases and NoSQL technologies is a plus. . .   Knowledge of distributed systems and technologies like Docker, Kubernetes, Spark, Hadoop, HBase, YARN is a plus. . .   Good communication, organization and interpersonal skills. . .   Ability to learn new technologies in a dynamic environment. . . . LI-JF1. . . . All qualified applicants will receive consideration for employment without regard to race, sex, color, religion, sexual orientation, gender identity, national origin, protected veteran status, or on the basis of disability.. "
  },
  "8caa6e1e-4977-11e8-9cb3-2c79226a2c46": {
    "title": "Cloud Product Operations Software Engineer",
    "description": ". Job Number23046. . . . At Informatica, We “DATA”. We Do Good, Act As One Team, Think Customer First, and Aspire For The Future. Informatica enables companies to unleash the power of data to become more agile, realize new growth opportunities, lead to new inventions resulting in intelligent market disruptions.. . . . A career with Informatica gives you all the opportunities and benefits that can only come from working for the trusted industry leader, including amazing, energetic team members; a globally diverse workplace; and a company dedicated to your success, growth and advancement.. . . . . Our Team. . . . . We’re always on the lookout for people with the same qualities as Informatica itself. As recognised leaders in Gartner’s Magic Quadrant for Data Management, we have no room for followers. We gained our market leading position through hard work, strong focus, incredible dedication and exceptional performance – the very virtues we are looking for in new Informatica people.. . . . We need people who carve their own niche, quickly understand priorities and know what needs to be done to get things moving. We expect our people to adapt to an informal atmosphere and appreciate the tremendous advantage of being surrounded by dedicated experts.. . . . In return, we offer the unique opportunity to join one of the most visionary, exciting and fastest growing software companies in the world, working with advanced technology and great products that are truly changing and improving the way our customers do business.. . . . . Your responsibilities. . . . . . .   Manage business applications on a brand-new cloud platform based on a microservice architecture.. . .   Take over responsibility for CI and deployment.. . .   Work in small teams in an agile process (SCRUM).. . .   Collaborate with colleagues from other teams across the globe.. . .   Proactively improve existing tools and processes.. . .   Document outcome of work, be able to present solution to others.. . . . . Your qualifications. . . . . . .   Experience as DevOps engineer or build engineer.. . .   Excellent knowledge of scripting languages like groovy, python.. . .   Knowledge in Cloud architecture like AWS and Azure.. . .   Excellent knowledge in UNIX.. . .   Good knowledge of Web technologies, security and network infrastructure.. . .   As a team-player you contribute reliable and systematic work.. . .   Fluent in German and English.. . . . . Relevant Languages / Frameworks / Technologies. . . . . . .   Chef, Terraform, Packer, Ansible. . .   REST, Message Queues. . .   Microservice Architecture Patterns, Docker. . .   Git, SVN, CI Pipelines. . .   Maven, Gradle, Gulp, Yarn, Ant. . . . Informatica offers a competitive compensation package that includes base salary, medical, retirement programs, flexible time off and more. Our generous benefits vary depending on your geographic work location. It’s an exciting time to work at Informatica, you can learn more about our company, our products and services at . www.informatica.com. . We are an Equal Opportunity Employer (EOE).. . . . . #LI-PH1. . . . . All qualified applicants will receive consideration for employment without regard to race, sex, color, religion, sexual orientation, gender identity, national origin, protected veteran status, or on the basis of disability.. "
  },
  "85200708-4977-11e8-92ee-e4b23655e198": {
    "title": "Software Engineer",
    "description": ". . Job Number:.  22701. . . . At Informatica, We “DATA”. We Do Good, Act As One Team, Think Customer First, and Aspire For The Future. Informatica enables companies to unleash the power of data to become more agile, realize new growth opportunities, lead to new inventions resulting in intelligent market disruptions.. . . . A career with Informatica gives you all the opportunities and benefits that can only come from working for the trusted industry leader, including amazing, energetic team members; a globally diverse workplace; and a company dedicated to your success, growth and advancement.. . . . . Our Team. . . . . As part of a growing R&amp;D organization in Tel Aviv, we are looking for a Senior Software engineer who is motivated to combine the art of design with the art of programming. This person will be part of a development team and will concentrate on development of a cloud application.. . . . . Your Opportunity. . . . . The successful candidate will participate in the development effort of our enterprise software within the B2B business unit of Informatica, located in Tel Aviv. As part of our development team you will be developing the next generation release of Informatica products.. . . . We are looking for an independent, innovative and resourceful software engineer with advanced problem solving skills, who enjoys working in fast paced product development organization. A quick learner, passionate, and experienced engineer that is also able to communicate effectively with other geographically separated teams and drive problems to solution.. . . . . Your Responsibilities. . . . . As a member of the Informatica’s R&amp;D organization in Tel Aviv you will:. . . . . .   Work closely with all team members to deliver best design and implementation of features within the team.. . .   Design technical solutions to product features.. . .   Be part of the server side development.. . .   Take responsibility of features development and follow-through with other team members working on the project to ensure high quality and on time delivery of the features.. . .   Regularly suggest enhancements to existing product that contributes to product goals.. . .   Work in Agile development process.. . .   Work with cross geographical R&amp;D engineering.. . .   Communicate across features and components within the product.. . . . . Our Requirements. . . . . . .   Team player.. . .   At least a BSC in Computer Science or equivalent, from a leading university in Israel.. . .   At least 3 years of hands on  . Java.   development experience with a strong technical background of product’s server side development.. . .   Deep understanding and experience working with relational database. Systems such as Oracle and MSSQL.. . .   Solid understanding of Object Oriented concepts.. . .   Good working experience and expertise in Unix/Linux.. . .   Understanding of large complex software systems.. . .   Self-starter with strong self-management skills.. . .   Strong knowledge of software implementation best practices.. . .   Strong analytical and problem solving skills.. . .   Good organization, communication and interpersonal skills.. . .   Development experience using Spring and Hibernate- Advantage.. . .   Cloud technologies - Advantage.. . .   Previous participation in Agile development – Advantage.. . .   Development experience using AngularJS, Javascript – Advantage.. . . . LI-JC1. . . . All qualified applicants will receive consideration for employment without regard to race, sex, color, religion, sexual orientation, gender identity, national origin, protected veteran status, or on the basis of disability.. "
  },
  "950b165c-496e-11e8-8291-f5e6e2589515": {
    "title": "Test Engineer",
    "description": ". DESCRIPTION: Changing the world is all in a day's work at Apple. If you love innovation, here's your chance to make a career of it. You'll work hard. But the job comes with more than a few perks.. . . . Imagine what you could do here. At Apple, new ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish.. . . . The Infrastructure Design Team is looking for a Test Engineer to improve testing capabilities for new and exciting technologies. We are a dynamic group doing phenomenal things. You will have the rare and rewarding opportunity to be part of the development of Data Center hardware.. . . . Key Qualifications:. . . . . . 7+ years of relevant experience.. . . Knowledge of SW and HW lifecycle, test methodologies, automation tools, test software, test fixtures, equipment and real passion for quality processes.. . . Proven ability working in an automated testing pipeline (Prototype + integration + system + functional + use case validation).. . . Ability to define/design/develop/maintain automated and manual test equipment for electro/mechanical assemblies, electronic hardware, and software.. . . Experience developing test automation software for qualification testing, verification/validation testing, functional test, test data logging, analyzing and presenting results.. . . . Description:. In this role, you will architect, design and maintain automation equipment used in the development and testing of hardware. This involves close collaboration in a multi-functional team of Software and Hardware Development engineers, architects, project managers and other Apple teams. You will also define, develop and implement the automated test equipment and software &amp; test results analysis, maintaining databases for test cases and test results, evaluating and reporting test data, developing and maintaining test tools.  . . . . Education:. BS or MS in CS/CE/EE or equivalent experience. . . . Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.. . . . REQUISITION NUMBER: 113705960. COMPANY NAME: Apple Inc.. "
  },
  "91b7623a-496e-11e8-923b-adce64dba9ba": {
    "title": "Server Side Software Engineer, Apple Media Products",
    "description": ". DESCRIPTION: Changing the world is all in a day's work at Apple. If you love innovation, here's your chance to make a career of it. You'll work hard. But the job comes with more than a few perks.. . . . The Apple Media Products team is looking for talented server-side engineers to build and enhance social features such as those underpinning Apple Music, the App Store, and Apple Podcasts. This is your opportunity to contribute to key Apple services, built using massively scaled systems, on a team located in San Francisco.. . . . Key Qualifications:. . . . . . Minimum of 5 years professional software engineering experience.. . . Experience in designing, implementing, and supporting scalable and server-side APIs.. . . Experience with data modeling and distributed data stores.. . . Experience with message-based architectures using Kafka or another message broker.. . . Ability to collaborate with multi-functional teams.. . . . Description:. Our team is responsible for architecting and delivering services central to Apple Music that allow users to interact with each other. To build these features, we create server-side applications that employ a combination of microservices, message-passing, caching layers, and distributed databases. We serve our data over cleanly designed RESTful HTTP endpoints used by multiple client platforms making a massive number of requests per second at millisecond response times.. . . . This is a great opportunity to join a small but growing team of motivated engineers, with wide responsibility and high-profile feature ownership. Whether you’re interested in architecture, data modeling, plumbing data pipelines, or designing endpoints, there are numerous possibilities for building new features from scratch and enhancing the existing infrastructure.. . . . Education:. BS or MS in Computer Science, or equivalent experience. . . . Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.. . . . REQUISITION NUMBER: 113099377. COMPANY NAME: Apple Inc.. "
  },
  "8e2eaf6a-496e-11e8-8554-1b960f76d2e2": {
    "title": "Sr. Video Search Engineer ",
    "description": ". DESCRIPTION: Changing the world is all in a day's work at Apple. If you love innovation, here's your chance to make a career of it. You'll work hard. But the job comes with more than a few perks.. . . . Apple is looking for experienced, self-driven engineers to deliver the next generation of Siri and instant Video Search on the TV app. This is an opportunity to be part of a team which is building and revamping search platforms to create a best in class video search experience for our customers. This is the perfect opportunity for someone who is passionate about search, and is excited about working cross-functionally to deliver the most polished customer experience in search..  . . . . Key Qualifications:. . . . . . Experience developing high quality, high performance Server Software in Java. . . Experience with HTTP server architecture. . . Experience with Information Retrieval techniques. . . Experience with search technologies and systems. . . Experience with Lucene/Solr or similar search engines preferred. . . Experience with video domain preferred. . . Knowledge of Hadoop/Spark is a plus. . . Good understanding of server-client protocols, algorithms and data structures. . . Ability to quickly prototype ideas and using creative approaches for solving complex problems.. . . . Description:. As a member of the Apple Media Products Search team you will be working on various components of the Search platform - search ranking, search query interpretation, language models, index data modeling and pipelines. Responsibilities will include design, development and maintenance of core search components that serves millions of customers worldwide. This role will be responsible for bringing the latest in search and discovery ideas to production at a large scale. If you want to craft new ways for customers to discover content in a rapidly growing catalog on the Apple ecosystem of devices and platforms, this is the place to be.. . . . Education:. BS, MS or PhD in Computer Science or related domains.. . . . Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.. . . . REQUISITION NUMBER: 113703532. COMPANY NAME: Apple Inc.. "
  },
  "89450de6-496e-11e8-8bd7-29d1c07e8855": {
    "title": "Sr. Software Engineer, Core Services, Apple Media Products",
    "description": ". DESCRIPTION: Changing the world is all in a day's work at Apple. If you love innovation, here's your chance to make a career of it. You'll work hard. But the job comes with more than a few perks.. . . . The iTunes Store is looking for a software engineer to help build creative features that will delight millions of customers around the world..  . . . . Key Qualifications:. . . . . . Authoritative knowledge of developing and scaling Java web applications with very stringent latency requirements.. . . Strong object oriented design and analysis skills coupled with a deep understanding of data structures and algorithms.. . . Experience in crafting and implementing RESTful APIs.. . . Experience working with object relational databases like Hibernate, Enterprise Objects Framework etc.. . . Extraordinary debugging, critical thinking, and interpersonal skills.. . . Experience with one or more of the NoSQL solutions (Memcached, Redis, Voldemort, Cassandra, MongoDB, Solr etc.). . . Experience writing effective unit and integration tests.. . . Knowledge of JVM-based languages like Clojure or Scala is a plus.. . . . Description:. Build large scale web-based projects and features, ensuring robust &amp; maintainable solutions while paying special attention to performance and usability details. Effectively demonstrate feature prototypes to executives. You will develop, advocate for, and build consensus on, coding standard methodologies. Ability to effectively work with multi-functional teams to understand requirements and engineer highly performant implementations. Experience with crafting web applications that scale to millions of requests per second is highly preferred..  . . . . Education:. BS or MS in Computer Science. 5 years professional software engineering experience preferred.. . . . Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.. . . . REQUISITION NUMBER: 113471078. COMPANY NAME: Apple Inc.. "
  },
  "80419840-496e-11e8-8be1-8e491a6480fb": {
    "title": "Software Engineer, Security",
    "description": ". DESCRIPTION: Changing the world is all in a day's work at Apple. If you love innovation, here's your chance to make a career of it. You'll work hard. But the job comes with more than a few perks.. . . . Join us and contribute to a better and more secure user experience across Apple’s products and services.. . . . Key Qualifications:. . . . . . Minimum of 2 years of directly related experience or PhD.. . . Object-oriented design and programming, ideally in Objective-C or Swift.. . . Experience with designing and integrating client side REST APIs. . . Debugging experience with stack traces, spin traces, performance &amp; concurrency/threading issues.. . . Knowledge or experience with Authentication, Single sign-on and Second Factor protocols.. . . Ability to work in a cross functional and collaborative environment.. . . Self-motivated, detail-oriented, critical, and good problem solving skills.. . . . Description:. Apple is looking for a Software Engineer to work on our user authentication technology. Must possess strong interest in the area of Authentication, Single sign-on and Second Factor protocols, cryptography, and code protection. Must have a strong understanding of consumer expectations and behaviors in this space. Multi-platform experience and working with different types of devices is a plus. Good communication skills are required for interfacing with other groups within and outside the company.. . . . Education:. MS or better in Computer Science or related technology.. . . . Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.. . . . REQUISITION NUMBER: 113670493. COMPANY NAME: Apple Inc.. "
  },
  "6860c742-4968-11e8-92ff-224f2e12c7e2": {
    "title": "Software Developer",
    "description": ". Geriatric Practice Management is a rapidly growing software company in the medical sector that offers powerful productivity and workflow tools to medical practitioners. Our small and energetic team is growing rapidly and we want you to contribute your unique skills and experience.. . . . We are a small, tightly knit group of developers located in the heart of downtown Asheville, NC. Our team develops software used daily by a rapidly growing number of physicians across the country, helping them provide excellent care for their patients.. . . . We value collaboration, getting things done, learning, and building high-quality, usable software using the best tools available. We use lightweight development practices to allow us to deliver functional software on a rapid deployment schedule.. . . . We're looking for talented developers to join our team!. . . . . Education / Credentials / Experience. . . . . . . 3+ years of coding experience. . . . . Good communication skills to work within a team or independently. . . . IT Computer Science degree preferred, plus years of practical experience.. . . Programming skills in languages such as C#, HTML, Java, .net, and SQL Server.. . . . . Essential Duties / Responsibilities. . . . . . . Coding, testing and debugging programs according to computer engineering specifications.. . . Modifying expanding and updating applications.. . . Communicating with a team that includes analysis, engineers and quality assurance testers in order to coordinate and document applications development and testing.. . . Developing software prototypes.. . . Maintains customer confidence and protects operations by keeping information confidential and secure.. . . Supports project resources scheduling and department capacity planning. . . . Works mostly on clearly defined and scoped individual features or problems.. . . Assumes a high level of ownership of all work developed by members of the team.. . . Have a positive impact on others and communicate openly and directly to individuals. . . Maintains customer confidence and protects operations by keeping information confidential and secure.. . . Other duties as assigned. . . Advance the capabilities of a small team of developers. . . . . GPM offers a competitive pay and benefits package, including health, dental, and vision insurance, short and long term disability, group life insurance, Flexible Spending Account, and 401k. Relocation reimbursement is available for this position.. . "
  },
  "254cffc8-4965-11e8-8691-2f098e1e702d": {
    "title": "Site Reliability Engineer",
    "description": ". Responsibilities include but are not limited to deploying, supporting, monitoring and troubleshooting large scale micro-service based distributed systems with high transaction volume; documenting the IT infrastructure, policies, and procedures. Applicants are also expected to participate in after-hours work and an on-call rotation.. . . . . All candidates will have. . . . . . . a Bachelor's or higher degree in technical field of study. . . a minimum of two years' experience deploying, monitoring and troubleshooting large scale distributed systems. . . a good understanding of network and routing protocols (TCP/IP, DNS and others). . . excellent knowledge of at least one modern programming language, such as Go, Java, C++, Python and Scala. . . experience with systems for automating deployment, scaling, and management of containerised applications, such as Kubernetes and Mesos. . . excellent troubleshooting and creative problem-solving abilities. . . excellent written and oral communication and interpersonal skills. . . . . Ideally, candidates will also have. . . . . . . experience deploying and supporting big data technologies, such as Kafka, Spark, Storm, Flink and Cassandra. . . experience implementing, operating, and supporting open source tools for network and security monitoring and management on Linux/Unix platforms. . . experience with encryption and cryptography standards. . . . . Location: Zurich, Switzerland. . "
  },
  "7ab6bac2-4964-11e8-9649-30ee0d9c61f2": {
    "title": "Security Engineer",
    "description": ". Responsibilities include but are not limited to reviewing designs, code, performing in-depth security assessments of mobile apps, distributed backend systems and internal IT infrastructure; developing custom security tools; documenting the infrastructure, policies, and procedures. Applicants are also expected to participate in after-hours work.. . . . . All candidates will have. . . . . . . a Bachelor's or higher degree in technical field of study. . . a minimum of two years security work experience. . . experience with performing application code reviews, design reviews and penetration testing. . . experience in penetration testing web-based apps, mobile apps and back-end infrastructure. . . experience implementing modern cryptosystems. . . excellent knowledge with at least one modern programming language, such as Go, Java, C++, Python and Scala. . . excellent troubleshooting and creative problem-solving abilities. . . excellent written and oral communication and interpersonal skills. . . . . Ideally, candidates will also have. . . . . . . experience with systems for automating deployment, scaling, and management of containerised applications, such as Kubernetes or Mesos. . . experience working with large scale distributed systems. . . . . Location: Zurich, Switzerland. . "
  },
  "allJobIDs": [
    "f8d4627a-7830-11e7-9e78-d9b1c842a413",
    "52a4e146-4e3f-11e8-8ef6-3fb76ee048bf",
    "a10e0222-9701-11e7-99b5-3e0083d090e0",
    "f127a8ca-fdd3-11e6-81a4-fe9da905eb01",
    "fa2381ba-fdd3-11e6-82c5-5b93b6d5fc76",
    "cd788a5e-97cd-11e7-81ed-ae7d47995799",
    "db9ef0f4-bfe7-11e7-98d4-d371577aa6c0",
    "15a1bd48-10da-11e8-8dd7-7617cf12b322",
    "40a95a22-4e20-11e8-9701-1b7423468ecc",
    "3f1f876c-4e20-11e8-94e4-aed74a007765",
    "3ca6476e-4e20-11e8-9201-52efa277c307",
    "1860dbd2-4e0a-11e8-824d-e9573fe33079",
    "c20a142a-4dfe-11e8-8bba-6e4e388640ae",
    "dab58272-4de3-11e8-9545-092ffb7f19b9",
    "409714aa-4de1-11e8-8546-20a952dfe08d",
    "428e51e4-4ddf-11e8-8a07-67eb144e5584",
    "f711f746-4ddb-11e8-8ba9-0bea8d2448e9",
    "949e5a7a-4d57-11e8-9178-6a21e83a3735",
    "776c9e60-4ca0-11e8-9860-71a43ad1cbdd",
    "eea00520-3487-11e8-9403-ba1a7cdf47b1",
    "7f854636-4c8e-11e8-89a6-641eafe1cf00",
    "d4ce5b1a-4c8d-11e8-8316-de2ea6887ec8",
    "3e405d78-1b29-11e8-88c9-b4b578163b5c",
    "fb6a544e-1b29-11e8-8062-e14cc69ae428",
    "f0204a80-4c57-11e8-953f-45c6f7e56dd0",
    "287b3c52-4a80-11e8-95d7-60a5a19c6c42",
    "2782ebb6-4a75-11e8-9ebb-47d33cbed1ee",
    "d37afd36-4a67-11e8-9114-574d811607c3",
    "cd806b64-4a21-11e8-9e08-652c5e9ffe1f",
    "f9de27fc-49f2-11e8-8e67-bca1a68363e5",
    "0c378362-49b2-11e8-89d0-6340ff903843",
    "ad6e9774-4977-11e8-808a-edb2ba4acd39",
    "a9e2d160-4977-11e8-8e7c-9d7c584925f8",
    "a6797222-4977-11e8-88ae-c942baa6c401",
    "a322bd0e-4977-11e8-82a2-f8413ac78eba",
    "9f891a9e-4977-11e8-9f66-9072f030ce32",
    "9c016b88-4977-11e8-877b-11c4ecdc8f84",
    "97786436-4977-11e8-8fe4-cb6755acd02c",
    "9466830e-4977-11e8-9583-d87ccdb8d62b",
    "9086d6d0-4977-11e8-8145-1c846733c22f",
    "8caa6e1e-4977-11e8-9cb3-2c79226a2c46",
    "85200708-4977-11e8-92ee-e4b23655e198",
    "950b165c-496e-11e8-8291-f5e6e2589515",
    "91b7623a-496e-11e8-923b-adce64dba9ba",
    "8e2eaf6a-496e-11e8-8554-1b960f76d2e2",
    "89450de6-496e-11e8-8bd7-29d1c07e8855",
    "80419840-496e-11e8-8be1-8e491a6480fb",
    "6860c742-4968-11e8-92ff-224f2e12c7e2",
    "254cffc8-4965-11e8-8691-2f098e1e702d",
    "7ab6bac2-4964-11e8-9649-30ee0d9c61f2"
  ]
}